#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThugZombieABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "ThugZombieABP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ThugZombieABP.ThugZombieABP_C
// 0x01B0 (0x0650 - 0x04A0)
class UThugZombieABP_C final : public UBTAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ThugZombieABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                // 0x04A8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04E8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0530(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0578(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0608(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ThugZombieABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ThugZombieABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThugZombieABP_C")
	}
	static class UThugZombieABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThugZombieABP_C>();
	}
};
DUMPER7_ASSERTS_UThugZombieABP_C;

}

