#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "BroTatoCommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BroTato_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetIsGlobalHiddenInWorld
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetIsGlobalHiddenInWorld final
{
public:
	bool                                          InHidden;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetIsGlobalHiddenInWorld;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.AddAttributeBonus_Lua
// 0x002C (0x002C - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_AddAttributeBonus_Lua final
{
public:
	struct FAttributeBonus                        AttributeBonus;                                    // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0028(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_AddAttributeBonus_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.OnRep_HealthShield
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_HealthShield final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_HealthShield;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetResurrecting
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetResurrecting final
{
public:
	bool                                          NewV;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetResurrecting;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.AddHealthShield
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_AddHealthShield final
{
public:
	EHealthShieldType                             in_Type;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShieldValue;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReset;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_AddHealthShield;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.ReduceHealth
// 0x0070 (0x0070 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_ReduceHealth final
{
public:
	float                                         RedValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InDamageMaker;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBTDamageParameters                    InTakeDamageParams;                                // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_ReduceHealth;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.UpdateFinalAddMoveSpeed
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_UpdateFinalAddMoveSpeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_UpdateFinalAddMoveSpeed;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetHealth
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetHealth final
{
public:
	float                                         NewV;                                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetHealth;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetAtkMoveFactor
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetAtkMoveFactor final
{
public:
	float                                         Factor;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetAtkMoveFactor;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.AddChargingShieldHealthFactor
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_AddChargingShieldHealthFactor final
{
public:
	float                                         Add;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_AddChargingShieldHealthFactor;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetFinalAbnormalState_AddMoveSpeed
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetFinalAbnormalState_AddMoveSpeed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetFinalAbnormalState_AddMoveSpeed;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetOutBattleHealthRevive
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetOutBattleHealthRevive final
{
public:
	float                                         NewV;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetOutBattleHealthRevive;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.AddHealth
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_AddHealth final
{
public:
	float                                         AddValue;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBTLifeRecoveryReason                         InReason;                                          // 0x0004(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_AddHealth;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.AddAttribute_Lua
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_AddAttribute_Lua final
{
public:
	EAttributeType                                Type;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_AddAttribute_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetAbnormalStateEffect
// 0x0002 (0x0002 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetAbnormalStateEffect final
{
public:
	uint8                                         State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShow;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetAbnormalStateEffect;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetHealthMaxBase
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetHealthMaxBase final
{
public:
	float                                         NewV;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetHealthMaxBase;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.OnRep_HealthMax
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_HealthMax final
{
public:
	float                                         InOldHealthMax;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_HealthMax;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetMaxDyingHealth
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetMaxDyingHealth final
{
public:
	float                                         NewV;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetMaxDyingHealth;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetZoomInMoveFactor
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetZoomInMoveFactor final
{
public:
	float                                         Factor;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetZoomInMoveFactor;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.SetIsBattling
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_SetIsBattling final
{
public:
	bool                                          InIsBattling;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_SetIsBattling;

// LuaFunction Transient.LUA_OVERRIDES_BTAttributeSet_2147482477.OnRep_Health
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_Health final
{
public:
	float                                         InOldHealth;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAttributeSet_2147482477_OnRep_Health;

// LuaFunction Transient.LUA_OVERRIDES_BP_MutipleProp_Saw_2_C_2147482493.UseProp_LuaImp
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_MutipleProp_Saw_2_C_2147482493_UseProp_LuaImp final
{
public:
	struct FVector                                InDirLoc;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_MutipleProp_Saw_2_C_2147482493_UseProp_LuaImp;

// LuaFunction Transient.LUA_OVERRIDES_WBP_DificultySelect_C_2147482474.OnItemSelectedStateChanged
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_DificultySelect_C_2147482474_OnItemSelectedStateChanged final
{
public:
	int32                                         CurSelectDificulty;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChange;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_DificultySelect_C_2147482474_OnItemSelectedStateChanged;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.Multicast_BeginRescueAnim_LuaImpl
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_BeginRescueAnim_LuaImpl final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_BeginRescueAnim_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.OnMovementInputChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnMovementInputChanged final
{
public:
	bool                                          InMoving;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnMovementInputChanged;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.BeginResurrection
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_BeginResurrection final
{
public:
	class ABTPlayerPawn*                          Rescuer;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_BeginResurrection;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.OnInsideGrassMakeDmgInServer
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnInsideGrassMakeDmgInServer final
{
public:
	class ABTPlayerPawn*                          InPlayerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnInsideGrassMakeDmgInServer;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.KillExtraLogic
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_KillExtraLogic final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETargetType                                   Type;                                              // 0x0018(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBTDamageParameters                    DamageParameter;                                   // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBeforKillCacheInfo                    BeforKillCacheInfo;                                // 0x0080(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAIType                                       InAIType;                                          // 0x00A0(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_KillExtraLogic;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.PlayGeneralRebirthEffect
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_PlayGeneralRebirthEffect final
{
public:
	struct FVector_NetQuantize                    InPos;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_PlayGeneralRebirthEffect;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.MainWeaponKillExtraLogic
// 0x0060 (0x0060 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_MainWeaponKillExtraLogic final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                tDirNormal;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETargetType                                   Type;                                              // 0x0030(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeforKillCacheInfo                    BeforKillCacheInfo;                                // 0x0038(0x0020)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         WeaponIndex;                                       // 0x0058(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_MainWeaponKillExtraLogic;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.Teleport
// 0x0038 (0x0038 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_Teleport final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          InIsPlayEffect;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_Teleport;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.Multicast_PlayTeleportEffect_LuaImpl
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_PlayTeleportEffect_LuaImpl final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_PlayTeleportEffect_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.Multicast_ResurrectionAnim_LuaImpl
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_ResurrectionAnim_LuaImpl final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_Multicast_ResurrectionAnim_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_BTAIPlayer_C_2147482492.OnInsideGrassAttackedByOtherInServer
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnInsideGrassAttackedByOtherInServer final
{
public:
	class ABTPlayerPawn*                          InPlayerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTAIPlayer_C_2147482492_OnInsideGrassAttackedByOtherInServer;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.Multicast_BeginRescueAnim_LuaImpl
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_BeginRescueAnim_LuaImpl final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_BeginRescueAnim_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.OnMovementInputChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnMovementInputChanged final
{
public:
	bool                                          InMoving;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnMovementInputChanged;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.BeginResurrection
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_BeginResurrection final
{
public:
	class ABTPlayerPawn*                          Rescuer;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_BeginResurrection;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.OnInsideGrassMakeDmgInServer
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnInsideGrassMakeDmgInServer final
{
public:
	class ABTPlayerPawn*                          InPlayerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnInsideGrassMakeDmgInServer;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.KillExtraLogic
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_KillExtraLogic final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETargetType                                   Type;                                              // 0x0018(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBTDamageParameters                    DamageParameter;                                   // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBeforKillCacheInfo                    BeforKillCacheInfo;                                // 0x0080(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAIType                                       InAIType;                                          // 0x00A0(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_KillExtraLogic;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.PlayGeneralRebirthEffect
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_PlayGeneralRebirthEffect final
{
public:
	struct FVector_NetQuantize                    InPos;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_PlayGeneralRebirthEffect;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.MainWeaponKillExtraLogic
// 0x0060 (0x0060 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_MainWeaponKillExtraLogic final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                tDirNormal;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETargetType                                   Type;                                              // 0x0030(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeforKillCacheInfo                    BeforKillCacheInfo;                                // 0x0038(0x0020)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         WeaponIndex;                                       // 0x0058(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_MainWeaponKillExtraLogic;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.Teleport
// 0x0038 (0x0038 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Teleport final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          InIsPlayEffect;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Teleport;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.Multicast_PlayTeleportEffect_LuaImpl
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_PlayTeleportEffect_LuaImpl final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_PlayTeleportEffect_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.Multicast_ResurrectionAnim_LuaImpl
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_ResurrectionAnim_LuaImpl final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_Multicast_ResurrectionAnim_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491.OnInsideGrassAttackedByOtherInServer
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnInsideGrassAttackedByOtherInServer final
{
public:
	class ABTPlayerPawn*                          InPlayerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NonHumanoidAIPlayer_LaserDog_6Beams_C_2147482491_OnInsideGrassAttackedByOtherInServer;

// LuaFunction Transient.LUA_OVERRIDES_BTGameStateBP_C_2147482478.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTGameStateBP_C_2147482478_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTGameStateBP_C_2147482478_ReceiveTick;

// LuaFunction Transient.LUA_OVERRIDES_BTGameStateBP_C_2147482478.SetPlayerTeam
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BTGameStateBP_C_2147482478_SetPlayerTeam final
{
public:
	class ABTPlayerState*                         InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamId;                                            // 0x0008(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTGameStateBP_C_2147482478_SetPlayerTeam;

// LuaFunction Transient.LUA_OVERRIDES_BTGameStateBP_C_2147482478.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTGameStateBP_C_2147482478_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTGameStateBP_C_2147482478_ReceiveEndPlay;

// LuaFunction Transient.LUA_OVERRIDES_BTGameStateBP_C_2147482478.LoadSubWorldMap
// 0x0048 (0x0048 - 0x0000)
struct LUA_OVERRIDES_BTGameStateBP_C_2147482478_LoadSubWorldMap final
{
public:
	struct FBTLevelStreamingDynamicInfo           InInfo;                                            // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTGameStateBP_C_2147482478_LoadSubWorldMap;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetAimingLoc
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetAimingLoc final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetAimingLoc;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetDefaultAimingPosition
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetDefaultAimingPosition final
{
public:
	struct FVector                                OutWorldPos;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetDefaultAimingPosition;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SkillJoystickTouchEnd
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchEnd final
{
public:
	int32                                         InSkillIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchEnd;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.Internal_ChangeSkillIndicatorErrorType
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ChangeSkillIndicatorErrorType final
{
public:
	bool                                          InbError;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ChangeSkillIndicatorErrorType;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.ReleaseSkillInServer
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseSkillInServer final
{
public:
	int32                                         InSkillIndex;                                      // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InReleaseSkillLoc;                                 // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseSkillInServer;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.Internal_ReleaseSkill
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ReleaseSkill final
{
public:
	bool                                          InbTriggerReleaseSuccessState;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ReleaseSkill;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.ReleaseDirectlyOrDisplaySkillIndicatorInPC
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseDirectlyOrDisplaySkillIndicatorInPC final
{
public:
	struct FSkillInfo                             tSkillInfo;                                        // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseDirectlyOrDisplaySkillIndicatorInPC;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SetPlayerBreakdownFirstDeadZone
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetPlayerBreakdownFirstDeadZone final
{
public:
	bool                                          InPlayerBreakdownFirstDeadZone;                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetPlayerBreakdownFirstDeadZone;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.CanReleaseSkill
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_CanReleaseSkill final
{
public:
	int32                                         InInputSkillIndex;                                 // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutReasonMsg;                                      // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	EBTSkillForbiddenType                         OutForbiddenType;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_CanReleaseSkill;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SetPlayerWantCancelBtnHovered
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetPlayerWantCancelBtnHovered final
{
public:
	bool                                          InCurrentCanNotReleaseSkillState;                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetPlayerWantCancelBtnHovered;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SkillJoystickTouchStart
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchStart final
{
public:
	int32                                         InSkillIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchStart;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.CorrectReleasePointPosition
// 0x0048 (0x0048 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_CorrectReleasePointPosition final
{
public:
	struct FVector                                InTargetPos;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutCorrectedPos;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutRealTraceHitPos;                                // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_CorrectReleasePointPosition;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.ReleaseSkill
// 0x0002 (0x0002 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseSkill final
{
public:
	bool                                          InbTriggerReleaseSuccessState;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DirectReleaseSkill;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_ReleaseSkill;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.IsSkillIndicatorIsErrorAiming
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorIsErrorAiming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorIsErrorAiming;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.OnInitialDataSyncOver
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_OnInitialDataSyncOver final
{
public:
	class UMyGameEvent*                           Param;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_OnInitialDataSyncOver;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.Internal_ReleaseDirectlyOrDisplaySkillIndicator
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ReleaseDirectlyOrDisplaySkillIndicator final
{
public:
	struct FSkillInfo                             tSkillInfo;                                        // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_ReleaseDirectlyOrDisplaySkillIndicator;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetCurrSkillType
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillType final
{
public:
	EBTSkillType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillType;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SwitchDisplaySkillIndicator
// 0x0100 (0x0100 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SwitchDisplaySkillIndicator final
{
public:
	struct FSkillTRB                              InSkillCf;                                         // 0x0000(0x0100)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SwitchDisplaySkillIndicator;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.InputSkill_Pressed
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_InputSkill_Pressed final
{
public:
	int32                                         InInputSkillIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_InputSkill_Pressed;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.Internal_InCurrPlayerFeetPosReleaseSkillIndicator
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_InCurrPlayerFeetPosReleaseSkillIndicator final
{
public:
	float                                         InfEffectRadius;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Internal_InCurrPlayerFeetPosReleaseSkillIndicator;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetSkillIndicatorRadius
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillIndicatorRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillIndicatorRadius;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SetSkillJoystickBreakFirstDeadZoneSpecial
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetSkillJoystickBreakFirstDeadZoneSpecial final
{
public:
	bool                                          InSkillJoystickBreakFirstDeadZoneSpecial;          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SetSkillJoystickBreakFirstDeadZoneSpecial;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.OnCharacterGuideSkillsLoseControlState
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_OnCharacterGuideSkillsLoseControlState final
{
public:
	bool                                          InbNewState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_OnCharacterGuideSkillsLoseControlState;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetTargetSelectHeightLimit
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetTargetSelectHeightLimit final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetTargetSelectHeightLimit;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetDefaultAimingTarget
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetDefaultAimingTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetDefaultAimingTarget;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.Tick_Skill_AimingUpdatePosInputRadiusPct
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Tick_Skill_AimingUpdatePosInputRadiusPct final
{
public:
	struct FVector2D                              InJoystickBGPctPos;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_Tick_Skill_AimingUpdatePosInputRadiusPct;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.UpdateSkillInfoData
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_UpdateSkillInfoData final
{
public:
	float                                         InfReleaseRadius;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_UpdateSkillInfoData;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.SkillJoystickTouchMove
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchMove final
{
public:
	int32                                         InSkillIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_SkillJoystickTouchMove;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetSkillRangeIndicatorLoc
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillRangeIndicatorLoc final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillRangeIndicatorLoc;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetSkillInfo
// 0x0038 (0x0038 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillInfo final
{
public:
	struct FSkillInfo                             OutSkillInfo;                                      // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillInfo;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetAimingDir
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetAimingDir final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetAimingDir;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetCurrUsingSkillIndex
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrUsingSkillIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrUsingSkillIndex;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetCurrSkillInfo_LuaImpl
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillInfo_LuaImpl final
{
public:
	struct FSkillInfo                             SkillInfo;                                         // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillInfo_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetSkillJoystickBreakFirstDeadZoneSpecial
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillJoystickBreakFirstDeadZoneSpecial final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetSkillJoystickBreakFirstDeadZoneSpecial;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetPlayerBreakdownFirstDeadZone
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetPlayerBreakdownFirstDeadZone final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetPlayerBreakdownFirstDeadZone;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.IsSkillIndicatorType
// 0x0002 (0x0002 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorType final
{
public:
	EBTSkillIndicatorType                         InType;                                            // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorType;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.GetCurrSkillTRB_LuaImpl
// 0x0100 (0x0100 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillTRB_LuaImpl final
{
public:
	struct FSkillTRB                              SkillTRB;                                          // 0x0000(0x0100)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_GetCurrSkillTRB_LuaImpl;

// LuaFunction Transient.LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476.IsSkillIndicatorIsDisplaying
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorIsDisplaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BTPlayerReleaseSkillComponent_2147482476_IsSkillIndicatorIsDisplaying;

