#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EmDrone_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass W_EmDrone_Skeleton_AnimBlueprint.W_EmDrone_Skeleton_AnimBlueprint_C
// 0x01B0 (0x0520 - 0x0370)
class UW_EmDrone_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x03A8(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x03B8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_W_EmDrone_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_EmDrone_Skeleton_AnimBlueprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_EmDrone_Skeleton_AnimBlueprint_C")
	}
	static class UW_EmDrone_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EmDrone_Skeleton_AnimBlueprint_C>();
	}
};
DUMPER7_ASSERTS_UW_EmDrone_Skeleton_AnimBlueprint_C;

}

