#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SmithyPromptEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SmithyPromptEntry.WBP_SmithyPromptEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_SmithyPromptEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SmithyPromptEntry_C_BP_OnItemExpansionChanged;

// Function WBP_SmithyPromptEntry.WBP_SmithyPromptEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_SmithyPromptEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SmithyPromptEntry_C_BP_OnItemSelectionChanged;

// Function WBP_SmithyPromptEntry.WBP_SmithyPromptEntry_C.ExecuteUbergraph_WBP_SmithyPromptEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_SmithyPromptEntry_C_ExecuteUbergraph_WBP_SmithyPromptEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USmithyPrompt*                          K2Node_DynamicCast_AsSmithy_Prompt;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SmithyPromptEntry_C_ExecuteUbergraph_WBP_SmithyPromptEntry;

// Function WBP_SmithyPromptEntry.WBP_SmithyPromptEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_SmithyPromptEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SmithyPromptEntry_C_OnListItemObjectSet;

}

