#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TaskEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TaskEntry.WBP_TaskEntry_C.ExecuteUbergraph_WBP_TaskEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_TaskEntry_C_ExecuteUbergraph_WBP_TaskEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TaskEntry_C_ExecuteUbergraph_WBP_TaskEntry;

// Function WBP_TaskEntry.WBP_TaskEntry_C.PlayAnim_SizeEffect
// 0x0001 (0x0001 - 0x0000)
struct WBP_TaskEntry_C_PlayAnim_SizeEffect final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TaskEntry_C_PlayAnim_SizeEffect;

}

