#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DificultySelect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DificultySelect.WBP_DificultySelect_C.ExecuteUbergraph_WBP_DificultySelect
// 0x0038 (0x0038 - 0x0000)
struct WBP_DificultySelect_C_ExecuteUbergraph_WBP_DificultySelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHightRisk;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_OpenedUrl;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DificultySelect_C_ExecuteUbergraph_WBP_DificultySelect;

// Function WBP_DificultySelect.WBP_DificultySelect_C.OnMediaOpened_Event
// 0x0010 (0x0010 - 0x0000)
struct WBP_DificultySelect_C_OnMediaOpened_Event final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DificultySelect_C_OnMediaOpened_Event;

// Function WBP_DificultySelect.WBP_DificultySelect_C.PlayHightRiskAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_DificultySelect_C_PlayHightRiskAnim final
{
public:
	bool                                          bHightRisk;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DificultySelect_C_PlayHightRiskAnim;

// Function WBP_DificultySelect.WBP_DificultySelect_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_DificultySelect_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DificultySelect_C_GetModuleName;

}

