#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GameSettings.WBP_GameSettings_C.ExecuteUbergraph_WBP_GameSettings
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameSettings_C_ExecuteUbergraph_WBP_GameSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameSettings_C_ExecuteUbergraph_WBP_GameSettings;

// Function WBP_GameSettings.WBP_GameSettings_C.Register Top Level Tab
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameSettings_C_Register_Top_Level_Tab final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameSettings_C_Register_Top_Level_Tab;

// Function WBP_GameSettings.WBP_GameSettings_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameSettings_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameSettings_C_BP_GetDesiredFocusTarget;

}

