#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_AutoAdsorbed

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_AutoAdsorbed.Weapon_AutoAdsorbed_C
// 0x0090 (0x0580 - 0x04F0)
class AWeapon_AutoAdsorbed_C final : public ABTMisc_AutoAdsorbed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ETimelineDirection                            __________Direction_7A82E73A45A78F1A98C27185F8AA4BD9; // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     更新特效吸附偏移; // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        AdsorptionOffsetZ;                                 // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NSC_Icon;                                          // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NSC_LightBeam;                                     // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          是否使用抛物线运动; // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FLinearColor>              ColorMap;                                          // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_AutoAdsorbedToTarget(class AActor* InTarget);
	void BP_OnAdsorbedFinished();
	void BP_OnDropFinished();
	void BP_OnDropStart();
	void BP_OnUpdateItemId();
	void ExecuteUbergraph_Weapon_AutoAdsorbed(int32 EntryPoint);
	void HideEffect_Icon();
	void HideEffect_LightBeam();
	void ShowEffect_Icon(double InOffsetZ);
	void ShowEffect_LightBeam();
	void UpdateEffectIcon(class UNiagaraComponent* InNSC);
	void 更新特效吸附偏移__FinishedFunc();
	void 更新特效吸附偏移__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_AutoAdsorbed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_AutoAdsorbed_C")
	}
	static class AWeapon_AutoAdsorbed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_AutoAdsorbed_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_AutoAdsorbed_C;

}

