#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie_Tank_ABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Zombie_Tank_ABP_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Zombie_Tank_ABP.Zombie_Tank_ABP_C
// 0x01F0 (0x0690 - 0x04A0)
class UZombie_Tank_ABP_C final : public UBTAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Zombie_Tank_ABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x04A8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B8(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x04C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0508(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0550(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0590(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05D8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0640(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Zombie_Tank_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Zombie_Tank_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Zombie_Tank_ABP_C")
	}
	static class UZombie_Tank_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombie_Tank_ABP_C>();
	}
};
DUMPER7_ASSERTS_UZombie_Tank_ABP_C;

}

