#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Wakanda_Post_processing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK::Params
{

// Function ABP_Wakanda_Post-processing.ABP_Wakanda_Post-processing_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Wakanda_Post_processing_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Wakanda_Post_processing_C_AnimGraph;

// Function ABP_Wakanda_Post-processing.ABP_Wakanda_Post-processing_C.ExecuteUbergraph_ABP_Wakanda_Post-processing
// 0x0064 (0x0064 - 0x0000)
struct ABP_Wakanda_Post_processing_C_ExecuteUbergraph_ABP_Wakanda_Post_processing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings;           // 0x0004(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_1;         // 0x001C(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_2;         // 0x0034(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_3;         // 0x004C(0x0018)(NoDestructor)
};
DUMPER7_ASSERTS_ABP_Wakanda_Post_processing_C_ExecuteUbergraph_ABP_Wakanda_Post_processing;

}

