#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sci_fi_Pistol_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Weapon_Ironsight_Types_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sci-fi_Pistol_01.BP_Sci-fi_Pistol_01_C
// 0x0058 (0x0370 - 0x0318)
class ABP_Sci_fi_Pistol_01_C final : public ASkeletalMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Sci_fi_Pistol_01_Ironsight_02;                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Sci_fi_Pistol_01_Ironsight_01;                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Blend_mode_Value;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ammo_Amount;                                       // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Skin_Color;                                        // 0x033C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeapon_Ironsight_Types_Enum                  Weapon_Ironsight_Type;                             // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFiring_;                                         // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AmmoShell_Actor;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MuzzleFlash_Actor;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Ammo_Empty_Sound;                                  // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Weapon_Camera_Shake;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Ammo_Empty();
	void Calculate(int32 Ammo_Value, int32* Ammo_Result);
	void End_Camera_Shake();
	void End_Fire();
	void ExecuteUbergraph_BP_Sci_fi_Pistol_01(int32 EntryPoint);
	void fire();
	void Perform_Camera_Shake();
	void Show_Ironsight_01(bool Show_Bool);
	void Show_Ironsight_02(bool Show_Bool);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Sci-fi_Pistol_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Sci-fi_Pistol_01_C")
	}
	static class ABP_Sci_fi_Pistol_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Sci_fi_Pistol_01_C>();
	}
};
DUMPER7_ASSERTS_ABP_Sci_fi_Pistol_01_C;

}

