#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BroTato

#include "Basic.hpp"

#include "BroTatoCommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum BroTato.EBTSimulationDamageType
// NumValues: 0x0004
enum class EBTSimulationDamageType : uint8
{
	None                                     = 0,
	Monster                                  = 1,
	SceneActor                               = 2,
	EBTSimulationDamageType_MAX              = 3,
};

// Enum BroTato.EBTStrongholdCampTurretBrokenState
// NumValues: 0x0004
enum class EBTStrongholdCampTurretBrokenState : uint8
{
	Normal                                   = 0,
	Broken                                   = 1,
	Destroyed                                = 2,
	EBTStrongholdCampTurretBrokenState_MAX   = 3,
};

// Enum BroTato.EBTEscapeAirshipState
// NumValues: 0x0007
enum class EBTEscapeAirshipState : uint8
{
	Disabled                                 = 0,
	AllowInteraction                         = 1,
	WaitingArrive                            = 2,
	Landing                                  = 3,
	WaitingTakeOff                           = 4,
	TakeOff                                  = 5,
	EBTEscapeAirshipState_MAX                = 6,
};

// Enum BroTato.EBTSandwormVehicleState
// NumValues: 0x0007
enum class EBTSandwormVehicleState : uint8
{
	None                                     = 0,
	WaitingCollectResource                   = 1,
	CollectResource                          = 2,
	CollectResourceEnd                       = 3,
	Moving                                   = 4,
	Finish                                   = 5,
	EBTSandwormVehicleState_MAX              = 6,
};

// Enum BroTato.EAIMovementMode
// NumValues: 0x0003
enum class EAIMovementMode : uint8
{
	MOVE_Walk                                = 0,
	MOVE_Custom                              = 1,
	MOVE_MAX                                 = 2,
};

// Enum BroTato.EAICustomMovementMode
// NumValues: 0x0006
enum class EAICustomMovementMode : uint8
{
	Custom_Repelled                          = 0,
	Custom_BeingSuckedAway                   = 1,
	Custom_Falling                           = 2,
	Custom_RootMotion                        = 3,
	Custom_OverrideCustom                    = 4,
	Custom_Max                               = 255,
};

// Enum BroTato.EAICustomRootMotionType
// NumValues: 0x0003
enum class EAICustomRootMotionType : uint8
{
	Translating                              = 0,
	Rotating                                 = 1,
	EAICustomRootMotionType_MAX              = 2,
};

// Enum BroTato.EFIRST_LEVEL_MISSION
// NumValues: 0x0003
enum class EFIRST_LEVEL_MISSION : uint8
{
	NORMAL                                   = 0,
	BATTLE                                   = 1,
	EFIRST_LEVEL_MAX                         = 2,
};

// Enum BroTato.ESECONDARY_LEVEL_MISSION_BATTLE
// NumValues: 0x0004
enum class ESECONDARY_LEVEL_MISSION_BATTLE : uint8
{
	FOLLOW                                   = 0,
	FIRE                                     = 1,
	ESCAPE                                   = 2,
	ESECONDARY_LEVEL_MISSION_MAX             = 3,
};

// Enum BroTato.ESECONDARY_LEVEL_MISSION_NORMAL
// NumValues: 0x0004
enum class ESECONDARY_LEVEL_MISSION_NORMAL : uint8
{
	WAITING                                  = 0,
	TO_ENEMY                                 = 1,
	TO_EVENT                                 = 2,
	ESECONDARY_LEVEL_MISSION_MAX             = 3,
};

// Enum BroTato.ECampType
// NumValues: 0x0004
enum class ECampType : uint8
{
	Neutral                                  = 0,
	Ours                                     = 1,
	Enemies                                  = 2,
	ECampType_MAX                            = 3,
};

// Enum BroTato.EBTAirdropBoxState
// NumValues: 0x0007
enum class EBTAirdropBoxState : uint8
{
	InSky                                    = 0,
	BeforeLanding                            = 1,
	Landing                                  = 2,
	InProgress                               = 3,
	OccupationCompleted                      = 4,
	EventFinish                              = 5,
	EBTAirdropBoxState_MAX                   = 6,
};

// Enum BroTato.EEntsSkillType
// NumValues: 0x0009
enum class EEntsSkillType : uint8
{
	None                                     = 0,
	MeleeAtk                                 = 1,
	MeteoriteBarrage                         = 2,
	Entanglement                             = 3,
	CircleShockwave                          = 4,
	StraightShockwave                        = 5,
	SprayMissileFromRear                     = 6,
	SummonMonster                            = 7,
	EEntsSkillType_MAX                       = 8,
};

// Enum BroTato.EBTLaserRobotSkillState
// NumValues: 0x0009
enum class EBTLaserRobotSkillState : uint8
{
	E_None                                   = 0,
	E_SkillLaser_Preparation                 = 1,
	E_SkillLaser_Aiming                      = 2,
	E_SkillLaser_AimEnd                      = 3,
	E_SkillLaser_Recover                     = 4,
	E_SkillBarrage_Preparation               = 5,
	E_SkillBarrage_Shooting                  = 6,
	E_SkillBarrage_Recover                   = 7,
	E_MAX                                    = 8,
};

// Enum BroTato.ELaserMonsterActionStage
// NumValues: 0x0007
enum class ELaserMonsterActionStage : uint8
{
	None                                     = 0,
	FastMoving                               = 1,
	LaserBeamPreparing                       = 2,
	LaserBeamAttacking                       = 3,
	LaserThrowPreparing                      = 4,
	LaserThrowing                            = 5,
	ELaserMonsterActionStage_MAX             = 6,
};

// Enum BroTato.EMechSpiderKingSkillType
// NumValues: 0x0007
enum class EMechSpiderKingSkillType : uint8
{
	None                                     = 0,
	Shooting                                 = 1,
	ContinuousBombing                        = 2,
	RangeBombing                             = 3,
	RotatingLaser                            = 4,
	SummonMonster                            = 5,
	EMechSpiderKingSkillType_MAX             = 6,
};

// Enum BroTato.EMedusaEyeSkillType
// NumValues: 0x0004
enum class EMedusaEyeSkillType : uint8
{
	BEAM                                     = 0,
	BARRAGE                                  = 1,
	MISSILE                                  = 2,
	EMedusaEyeSkillType_MAX                  = 3,
};

// Enum BroTato.ENoxiousInsectKingSkill
// NumValues: 0x0007
enum class ENoxiousInsectKingSkill : uint8
{
	None                                     = 0,
	HitInPlace_Light                         = 1,
	HitInPlace_Heavy                         = 2,
	Sprint                                   = 3,
	SprayVenom                               = 4,
	SummonVenomArea                          = 5,
	ENoxiousInsectKingSkill_MAX              = 6,
};

// Enum BroTato.ETwinsType
// NumValues: 0x0003
enum class ETwinsType : uint8
{
	Flame                                    = 0,
	Ice                                      = 1,
	ETwinsType_MAX                           = 2,
};

// Enum BroTato.EBTCarMovementStatus
// NumValues: 0x0006
enum class EBTCarMovementStatus : uint8
{
	STOP                                     = 0,
	FORWARD_ACC                              = 1,
	FORWARD_BREAK                            = 2,
	BACK_ACC                                 = 3,
	BACK_BREAK                               = 4,
	EBTCarMovementStatus_MAX                 = 5,
};

// Enum BroTato.EActionBehavior
// NumValues: 0x0015
enum class EActionBehavior : uint8
{
	Invalid                                  = 0,
	Reborn                                   = 1,
	Idle                                     = 2,
	Move                                     = 3,
	MeleeAttack                              = 4,
	RangeAttack                              = 5,
	Hurt                                     = 6,
	repel_back                               = 7,
	repel_front                              = 8,
	repel_fly                                = 9,
	Dead                                     = 10,
	Disintegrate                             = 11,
	Stun                                     = 12,
	Dodge                                    = 13,
	Interrupted                              = 14,
	SummonCompanion                          = 15,
	Rolling                                  = 16,
	PendingBombBegin                         = 17,
	PendingBombLooping                       = 18,
	Escape                                   = 19,
	EActionBehavior_MAX                      = 20,
};

// Enum BroTato.EBTClimbingWallFakeMonsterMovingState
// NumValues: 0x0004
enum class EBTClimbingWallFakeMonsterMovingState : uint8
{
	None                                     = 0,
	Moving                                   = 1,
	Falling                                  = 2,
	EBTClimbingWallFakeMonsterMovingState_MAX = 3,
};

// Enum BroTato.EBTEnergyDeviceState
// NumValues: 0x0006
enum class EBTEnergyDeviceState : uint8
{
	Disabled                                 = 0,
	Ready                                    = 1,
	InOpenProgress                           = 2,
	InProgress                               = 3,
	Completed                                = 4,
	EBTEnergyDeviceState_MAX                 = 5,
};

// Enum BroTato.EBTTriggerMsgTargetType
// NumValues: 0x0004
enum class EBTTriggerMsgTargetType : uint8
{
	OnlyInstigator                           = 0,
	InstigatorTeam                           = 1,
	AllPlayer                                = 2,
	EBTTriggerMsgTargetType_MAX              = 3,
};

// Enum BroTato.EBTGameFlowTriggerInstigatorType
// NumValues: 0x0004
enum class EBTGameFlowTriggerInstigatorType : uint8
{
	None                                     = 0,
	Player                                   = 1,
	SpecialSceneActor                        = 2,
	EBTGameFlowTriggerInstigatorType_MAX     = 3,
};

// Enum BroTato.EAchievementFlag
// NumValues: 0x0029
enum class EAchievementFlag : uint8
{
	EAF_FirstWinBySMG                        = 0,
	EAF_FirstWinByRifle                      = 1,
	EAF_FirstWinByRocket                     = 2,
	EAF_FirstWinBySnipe                      = 3,
	EAF_FirstWinByBow                        = 4,
	EAF_FirstKillBoss_NoxiousSpiderKing      = 5,
	EAF_FirstKillBoss_Ents                   = 6,
	EAF_FirstKillBoss_Tyrant                 = 7,
	EAF_FirstKillBoss_Butcher                = 8,
	EAF_FirstKillBoss_Twins                  = 9,
	EAF_FirstKillBoss_DeathAngel             = 10,
	EAF_FirstPassMapWithDifficult1           = 11,
	EAF_FirstPassMapWithDifficult2           = 12,
	EAF_FirstPassMapWithDifficult3           = 13,
	EAF_FirstPassMapWithDifficult4           = 14,
	EAF_FirstPassMapWithDifficult5           = 15,
	EAF_KillAIOver50000                      = 16,
	EAF_KillEliteAIOver500                   = 17,
	EAF_KillBossAIOver50                     = 18,
	EAF_CompleteTaskOver80                   = 19,
	EAF_FirstDeath                           = 20,
	EAF_FirstReBorn                          = 21,
	EAF_FirstWinWithRant5                    = 22,
	EAF_SurveyEventOver30InOneBattle         = 23,
	EAF_GetDifferentTechOver15InOneBattle    = 24,
	EAF_GetDarkColdEquipOver4InOneBattle     = 25,
	EAF_GetGoldCoinOver200000                = 26,
	EAF_PassDungeon                          = 27,
	EAF_FirstBuyItem                         = 28,
	EAF_FirstGetDarkGoldEquip                = 29,
	EAF_FullEquip                            = 30,
	EAF_GetWeaponItemOver20                  = 31,
	EAF_GetArmorItemOver100                  = 32,
	EAF_FirstDecompose                       = 33,
	EAF_FirstRefine                          = 34,
	EAF_FirstContract                        = 35,
	EAF_FirstBugWareHouseTab                 = 36,
	EAF_CostTalentPointOver20                = 37,
	EAF_GetItemInWareHouseOver100            = 38,
	EAF_AllHerosUpGradeForty                 = 39,
	EAF_Max                                  = 40,
};

// Enum BroTato.EBTEventUIType
// NumValues: 0x0004
enum class EBTEventUIType : uint8
{
	SmallEvent                               = 0,
	CommonEvent                              = 1,
	AirdropEvent                             = 2,
	EBTEventUIType_MAX                       = 3,
};

// Enum BroTato.EBTPointAreaShape
// NumValues: 0x0003
enum class EBTPointAreaShape : uint8
{
	Box                                      = 0,
	Circle                                   = 1,
	EBTPointAreaShape_MAX                    = 2,
};

// Enum BroTato.EBTAdvancedPVEModeSubType
// NumValues: 0x0003
enum class EBTAdvancedPVEModeSubType : uint8
{
	None                                     = 0,
	Sandworm                                 = 1,
	EBTAdvancedPVEModeSubType_MAX            = 2,
};

// Enum BroTato.EBTTimeLineMsgType_AdvancedPVE_Sandworm
// NumValues: 0x0006
enum class EBTTimeLineMsgType_AdvancedPVE_Sandworm : uint8
{
	None                                     = 0,
	GameStart                                = 1,
	SandwormVehicleCollectResourceStart      = 2,
	SandwormVehicleCollectResourceEnd        = 3,
	SandwormVehicleStartMoving               = 4,
	EBTTimeLineMsgType_AdvancedPVE_MAX       = 5,
};

// Enum BroTato.EBTStageModeSubType
// NumValues: 0x0009
enum class EBTStageModeSubType : uint8
{
	None                                     = 0,
	AToB                                     = 1,
	CountdownSurvival                        = 2,
	ProtectingTargets                        = 3,
	ExploreEventLocation                     = 4,
	OccupyStronghold                         = 5,
	EliteMonster                             = 6,
	Boss                                     = 7,
	EBTStageModeSubType_MAX                  = 8,
};

// Enum BroTato.EBTSurvivalModeSubType
// NumValues: 0x0004
enum class EBTSurvivalModeSubType : uint8
{
	PVP_1Player                              = 0,
	PVP_2Player                              = 1,
	PVE                                      = 2,
	EBTSurvivalModeSubType_MAX               = 3,
};

// Enum BroTato.EBTSurvivalPhaseType
// NumValues: 0x0006
enum class EBTSurvivalPhaseType : uint8
{
	FloorFallDown                            = 0,
	Battle                                   = 1,
	Battle_Relaxation                        = 2,
	Reward                                   = 3,
	Reward_Relaxation                        = 4,
	EBTSurvivalPhaseType_MAX                 = 5,
};

// Enum BroTato.EBThrowMonsterType
// NumValues: 0x0003
enum class EBThrowMonsterType : uint8
{
	SprintMonster                            = 0,
	FireDragon                               = 1,
	EBThrowMonsterType_MAX                   = 2,
};

// Enum BroTato.EBTMonsterSearchEnemyTargetType
// NumValues: 0x0004
enum class EBTMonsterSearchEnemyTargetType : uint8
{
	E_Player                                 = 0,
	E_SceneActor                             = 1,
	E_PlayerOrSceneActor                     = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBossPairType
// NumValues: 0x0007
enum class EBossPairType : uint8
{
	Tyrant                                   = 0,
	Butcher                                  = 1,
	SpiderKing                               = 2,
	Ents                                     = 3,
	Twins                                    = 4,
	DeathAngel                               = 5,
	EBossPairType_MAX                        = 6,
};

// Enum BroTato.ESpawnMonsterType
// NumValues: 0x0009
enum class ESpawnMonsterType : uint8
{
	E_WildMonster                            = 0,
	E_SpecialWildMonster                     = 1,
	E_PointBoxMultiWaveMonster               = 2,
	E_GameRule                               = 3,
	E_GameplayEvent                          = 4,
	E_CommonSpawnMonsterTask                 = 5,
	E_GlobalRandomMonster                    = 6,
	E_Other                                  = 7,
	E_MAX                                    = 8,
};

// Enum BroTato.EBTStartPointType
// NumValues: 0x0005
enum class EBTStartPointType : uint8
{
	E_StartPoint                             = 0,
	E_RebirthPoint                           = 1,
	E_Both                                   = 2,
	E_SpecialRebirthPoint                    = 3,
	E_MAX                                    = 4,
};

// Enum BroTato.EBTLevelUpBDOption
// NumValues: 0x0005
enum class EBTLevelUpBDOption : uint8
{
	E_Random                                 = 0,
	E_MainWeapon                             = 1,
	E_SecondaryWeapon                        = 2,
	E_Item                                   = 3,
	E_MAX                                    = 4,
};

// Enum BroTato.EBTPocketShopType
// NumValues: 0x0005
enum class EBTPocketShopType : uint8
{
	E_None                                   = 0,
	E_MainWeapon                             = 1,
	E_SecondaryWeapon                        = 2,
	E_Item                                   = 3,
	E_MAX                                    = 4,
};

// Enum BroTato.EBTAISpawnMode
// NumValues: 0x0004
enum class EBTAISpawnMode : uint8
{
	E_FixedPoint                             = 0,
	E_UseRandomRange                         = 1,
	E_NearPlayer                             = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTMonsterAttackTargetType
// NumValues: 0x0006
enum class EBTMonsterAttackTargetType : uint8
{
	E_None                                   = 0,
	E_BirthAreaTarget                        = 1,
	E_OtherAreaTarget                        = 2,
	E_Instigator                             = 3,
	E_InstigatorAndTeammates                 = 4,
	E_MAX                                    = 5,
};

// Enum BroTato.EBTMonsterWaveType_Survival
// NumValues: 0x0004
enum class EBTMonsterWaveType_Survival : uint8
{
	E_Normal                                 = 0,
	E_Boss                                   = 1,
	E_Reward                                 = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTThrowMonsterFailReason
// NumValues: 0x0004
enum class EBTThrowMonsterFailReason : uint8
{
	E_None                                   = 0,
	E_ErrorPhase                             = 1,
	E_IsTargetInSpecialSkillShieldState      = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTNPCAliveState
// NumValues: 0x0003
enum class EBTNPCAliveState : uint8
{
	Alive                                    = 0,
	Dead                                     = 1,
	EBTNPCAliveState_MAX                     = 2,
};

// Enum BroTato.EBTCommonEventState
// NumValues: 0x0004
enum class EBTCommonEventState : uint8
{
	NotStart                                 = 0,
	InProgress                               = 1,
	Finish                                   = 2,
	EBTCommonEventState_MAX                  = 3,
};

// Enum BroTato.EBTTreasureChestState
// NumValues: 0x0006
enum class EBTTreasureChestState : uint8
{
	Ready                                    = 0,
	InProgress                               = 1,
	EventFinish                              = 2,
	Preparing                                = 3,
	Disable                                  = 4,
	EBTTreasureChestState_MAX                = 5,
};

// Enum BroTato.EBTWildMonsterSpawnType
// NumValues: 0x0004
enum class EBTWildMonsterSpawnType : uint8
{
	E_PlayerCloseTo                          = 0,
	E_ExternalActivation                     = 1,
	E_WildMonsterDie                         = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTWildMonsterSpecialMark
// NumValues: 0x0003
enum class EBTWildMonsterSpecialMark : uint8
{
	E_None                                   = 0,
	E_LevelGuardMonster                      = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EBTWaveActiveType
// NumValues: 0x0003
enum class EBTWaveActiveType : uint8
{
	E_Distance                               = 0,
	E_GameRule                               = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EBTWaveEndType
// NumValues: 0x0004
enum class EBTWaveEndType : uint8
{
	E_WaveTimeEnd                            = 0,
	E_MonsterAllDie                          = 1,
	E_WaveTimeEndOrMonsterAllDie             = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTSplineType
// NumValues: 0x0003
enum class EBTSplineType : uint8
{
	E_Default                                = 0,
	E_GuideLine                              = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EPlayerHealthType
// NumValues: 0x0004
enum class EPlayerHealthType : uint8
{
	CurHealth                                = 0,
	MaxHealth                                = 1,
	ShieldHealth                             = 2,
	EPlayerHealthType_MAX                    = 3,
};

// Enum BroTato.EBTDyingState_UI
// NumValues: 0x0005
enum class EBTDyingState_UI : uint8
{
	Normal                                   = 0,
	Dying                                    = 1,
	Rescuing                                 = 2,
	BeSaved                                  = 3,
	EBTDyingState_MAX                        = 4,
};

// Enum BroTato.EBTSurvivalMsgType
// NumValues: 0x0007
enum class EBTSurvivalMsgType : uint8
{
	None                                     = 0,
	BossWave                                 = 1,
	AwardWave                                = 2,
	NormalWave                               = 3,
	FloorFalldownWave                        = 4,
	RelaxationWave                           = 5,
	EBTSurvivalMsgType_MAX                   = 6,
};

// Enum BroTato.ESettingPanelType
// NumValues: 0x0008
enum class ESettingPanelType : uint8
{
	None                                     = 0,
	DisplayMode                              = 1,
	Resolution                               = 2,
	Audio                                    = 3,
	Lan_Text                                 = 4,
	Lan_Voice                                = 5,
	FPS                                      = 6,
	ESettingPanelType_MAX                    = 7,
};

// Enum BroTato.EBTChestState
// NumValues: 0x0005
enum class EBTChestState : uint8
{
	Init                                     = 0,
	Available                                = 1,
	Unavailable                              = 2,
	Preparing                                = 3,
	EBTChestState_MAX                        = 4,
};

// Enum BroTato.EBTInteractionReplyResult
// NumValues: 0x0003
enum class EBTInteractionReplyResult : uint8
{
	E_Unhandled                              = 0,
	E_Handled                                = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EAutoDoorOpenRelative
// NumValues: 0x0007
enum class EAutoDoorOpenRelative : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	InverseX                                 = 3,
	InverseY                                 = 4,
	InverseZ                                 = 5,
	EAutoDoorOpenRelative_MAX                = 6,
};

// Enum BroTato.EAutoDoorStatus
// NumValues: 0x0005
enum class EAutoDoorStatus : uint8
{
	Opening                                  = 0,
	Opened                                   = 1,
	Closing                                  = 2,
	Closed                                   = 3,
	EAutoDoorStatus_MAX                      = 4,
};

// Enum BroTato.EBTLightningChainJumpType
// NumValues: 0x0004
enum class EBTLightningChainJumpType : uint8
{
	Random                                   = 0,
	Nearest                                  = 1,
	NearToFar                                = 2,
	EBTLightningChainJumpType_MAX            = 3,
};

// Enum BroTato.FBTLightningChainEffectLocType
// NumValues: 0x0004
enum class EFBTLightningChainEffectLocType : uint8
{
	Location                                 = 0,
	TargetActor                              = 1,
	WeaponIndex                              = 2,
	FBTLightningChainEffectLocType_MAX       = 3,
};

// Enum BroTato.EUpgradeAirdropBoxType
// NumValues: 0x0003
enum class EUpgradeAirdropBoxType : uint8
{
	UpgradeAirdropBoxType_Normal             = 0,
	UpgradeAirdropBoxType_ARC                = 1,
	UpgradeAirdropBoxType_MAX                = 2,
};

// Enum BroTato.EMissileLauncherType
// NumValues: 0x0004
enum class EMissileLauncherType : uint8
{
	E_Fixed                                  = 0,
	E_Snipe                                  = 1,
	E_Random                                 = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.ELauncherDirectionType
// NumValues: 0x0003
enum class ELauncherDirectionType : uint8
{
	E_Origin                                 = 0,
	E_Launcher                               = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EBTMovableObstacleState
// NumValues: 0x0005
enum class EBTMovableObstacleState : uint8
{
	Disable                                  = 0,
	Ready                                    = 1,
	Active                                   = 2,
	Recover                                  = 3,
	EBTMovableObstacleState_MAX              = 4,
};

// Enum BroTato.EBTNavAreaFlag
// NumValues: 0x0003
enum class EBTNavAreaFlag : uint8
{
	MONSTER_PASS                             = 0,
	AIPLAYER_PASS                            = 1,
	EBTNavAreaFlag_MAX                       = 2,
};

// Enum BroTato.EBTNPCUpdateEnemyResult
// NumValues: 0x0005
enum class EBTNPCUpdateEnemyResult : uint8
{
	None                                     = 0,
	BattleStart                              = 1,
	BattleEnd                                = 2,
	SwitchTarget                             = 3,
	EBTNPCUpdateEnemyResult_MAX              = 4,
};

// Enum BroTato.EAngleFourDivideType
// NumValues: 0x0005
enum class EAngleFourDivideType : uint8
{
	FORWARD                                  = 0,
	RIGHT                                    = 1,
	BACK                                     = 2,
	LEFT                                     = 3,
	EAngleFourDivideType_MAX                 = 4,
};

// Enum BroTato.EInjuryImmunityType
// NumValues: 0x0005
enum class EInjuryImmunityType : uint8
{
	II_None                                  = 0,
	II_General                               = 1,
	II_Rebirth                               = 2,
	II_GameOver                              = 4,
	II_MAX                                   = 5,
};

// Enum BroTato.ELoseControlOnClient
// NumValues: 0x0005
enum class ELoseControlOnClient : uint8
{
	None                                     = 0,
	ButLookAt                                = 1,
	ButMoving                                = 2,
	Fully                                    = 3,
	ELoseControlOnClient_MAX                 = 4,
};

// Enum BroTato.ERangeHaveEnemy
// NumValues: 0x0004
enum class ERangeHaveEnemy : uint8
{
	None                                     = 0,
	Monster                                  = 1,
	Player                                   = 2,
	ERangeHaveEnemy_MAX                      = 3,
};

// Enum BroTato.EPropsSkillType
// NumValues: 0x0004
enum class EPropsSkillType : uint8
{
	TacticalDevice                           = 0,
	Sprint                                   = 1,
	Throw                                    = 2,
	EPropsSkillType_MAX                      = 3,
};

// Enum BroTato.EBTRebirthLocationType
// NumValues: 0x0004
enum class EBTRebirthLocationType : uint8
{
	E_StartPoint                             = 0,
	E_RebirthPoint                           = 1,
	E_Both                                   = 2,
	E_MAX                                    = 3,
};

// Enum BroTato.EBTRoadBlockTakeDamageType
// NumValues: 0x0003
enum class EBTRoadBlockTakeDamageType : uint8
{
	E_OnlyTakeDamageFromPlayer               = 0,
	E_OnlyTakeDamageFromBoss                 = 1,
	E_MAX                                    = 2,
};

// Enum BroTato.EBTSampleCollectorState
// NumValues: 0x0007
enum class EBTSampleCollectorState : uint8
{
	Ready                                    = 0,
	WaitingAllSubdevicesInPlace              = 1,
	InProgress                               = 2,
	EventFinish                              = 3,
	Preparing                                = 4,
	Disable                                  = 5,
	EBTSampleCollectorState_MAX              = 6,
};

// Enum BroTato.EBTSampleCollectorSubdeviceState
// NumValues: 0x0006
enum class EBTSampleCollectorSubdeviceState : uint8
{
	NotStarted                               = 0,
	NotStarted_Moving                        = 1,
	InProgress                               = 2,
	Finish_Moving                            = 3,
	Finish                                   = 4,
	EBTSampleCollectorSubdeviceState_MAX     = 5,
};

// Enum BroTato.EBTAirshipBattleBossLocationType
// NumValues: 0x0004
enum class EBTAirshipBattleBossLocationType : uint8
{
	Hidden                                   = 0,
	LeftSide                                 = 1,
	RightSide                                = 2,
	EBTAirshipBattleBossLocationType_MAX     = 3,
};

// Enum BroTato.EBTAirshipBattleCameraState
// NumValues: 0x0005
enum class EBTAirshipBattleCameraState : uint8
{
	None                                     = 0,
	Middle                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	EBTAirshipBattleCameraState_MAX          = 4,
};

// Enum BroTato.EBTSceneTakeDamageActorState
// NumValues: 0x0005
enum class EBTSceneTakeDamageActorState : uint8
{
	Default                                  = 0,
	LittleInjury                             = 1,
	BigInjury                                = 2,
	Death                                    = 3,
	EBTSceneTakeDamageActorState_MAX         = 4,
};

// Enum BroTato.EBTOneWayElevatorState
// NumValues: 0x0004
enum class EBTOneWayElevatorState : uint8
{
	AtStartPoint                             = 0,
	Running                                  = 1,
	AtEndPoint                               = 2,
	EBTOneWayElevatorState_MAX               = 3,
};

// Enum BroTato.EBTEscapePointState
// NumValues: 0x0004
enum class EBTEscapePointState : uint8
{
	Hidden                                   = 0,
	Activated                                = 1,
	Disabled                                 = 2,
	EBTEscapePointState_MAX                  = 3,
};

// Enum BroTato.EBTLandMineState
// NumValues: 0x0006
enum class EBTLandMineState : uint8
{
	None                                     = 0,
	PlacementInProgress                      = 1,
	PlacementEnd                             = 2,
	ExplosionAlert                           = 3,
	Broken                                   = 4,
	EBTLandMineState_MAX                     = 5,
};

// Enum BroTato.EBTStageModeStrongholdState
// NumValues: 0x0005
enum class EBTStageModeStrongholdState : uint8
{
	Init                                     = 0,
	Unoccupied                               = 1,
	InProgress                               = 2,
	Finished                                 = 3,
	EBTStageModeStrongholdState_MAX          = 4,
};

// Enum BroTato.EBTSurvivalFloorState
// NumValues: 0x0004
enum class EBTSurvivalFloorState : uint8
{
	Complete                                 = 0,
	SmallFallDown                            = 1,
	BigFallDown                              = 2,
	EBTSurvivalFloorState_MAX                = 3,
};

// Enum BroTato.EBTVehicleEscortEventState
// NumValues: 0x0005
enum class EBTVehicleEscortEventState : uint8
{
	Ready                                    = 0,
	InProgress                               = 1,
	Finish                                   = 2,
	Disable                                  = 3,
	EBTVehicleEscortEventState_MAX           = 4,
};

// Enum BroTato.EBTVehicleEscortSubEventState
// NumValues: 0x0009
enum class EBTVehicleEscortSubEventState : uint8
{
	MoveTo_NoiseCrystalLocation              = 0,
	NoiseCrystal                             = 1,
	CrystalDefense                           = 2,
	MoveTo_ChargingEnergyLocation            = 3,
	ChargingEnergy                           = 4,
	MoveTo_CollectResourceLocation           = 5,
	CollectResource                          = 6,
	Finish                                   = 7,
	EBTVehicleEscortSubEventState_MAX        = 8,
};

// Enum BroTato.EBTVehicleEscortTimeLineMsgType
// NumValues: 0x0006
enum class EBTVehicleEscortTimeLineMsgType : uint8
{
	None                                     = 0,
	NoiseCrystal                             = 1,
	CrystalDefense                           = 2,
	ChargingEnergy                           = 3,
	CollectResource                          = 4,
	EBTVehicleEscortTimeLineMsgType_MAX      = 5,
};

// Enum BroTato.EClassRepNodeMapping
// NumValues: 0x0008
enum class EClassRepNodeMapping : uint8
{
	NotRouted                                = 0,
	RelevantAllConnections                   = 1,
	RelevantOwnerConnection                  = 2,
	RelevantTeamConnection                   = 3,
	Spatialize_Static                        = 4,
	Spatialize_Dynamic                       = 5,
	Spatialize_Dormancy                      = 6,
	EClassRepNodeMapping_MAX                 = 7,
};

// Enum BroTato.EOtherItemType
// NumValues: 0x0008
enum class EOtherItemType : uint8
{
	E_Gold                                   = 0,
	E_BaseMaterial                           = 1,
	E_RewardAdvancedMaterial                 = 2,
	E_Talent                                 = 3,
	E_Crystal                                = 4,
	E_Chest                                  = 5,
	E_Attribute                              = 6,
	E_MAX                                    = 7,
};

// ScriptStruct BroTato.MyAnimUpdateRateDistanceInfo
// 0x0008 (0x0008 - 0x0000)
struct FMyAnimUpdateRateDistanceInfo final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rate;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyAnimUpdateRateDistanceInfo;

// ScriptStruct BroTato.BTSandwormVehicleRepairInfo
// 0x0010 (0x0010 - 0x0000)
struct FBTSandwormVehicleRepairInfo final
{
public:
	class ABTPlayerState*                         RepairingPS;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RepairBeginTime;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RepairDuration;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTSandwormVehicleRepairInfo;

// ScriptStruct BroTato.BTDamageParameters
// 0x0060 (0x0060 - 0x0000)
struct FBTDamageParameters final
{
public:
	struct FVector                                HitDir;                                            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLoc;                                            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         WeaponIndex;                                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrit;                                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         HitPartIndex;                                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDmgType                                      DmgType;                                           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBTDmgReason                                  DmgReason;                                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DmgReasonAdditionalId;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromDebuff;                                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillDamageUID;                                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadshot;                                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Repel;                                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ExplisionLevel;                                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BulletUID;                                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPhysicalDamage;                                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBTSimulationDamageType                       SimulationDamageType;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SimulationDamageInstigatorId;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABTPlayerState*                         SimulationDamageInstigatorOwnerPlayer;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTDamageParameters;

// ScriptStruct BroTato.BTRandomMonsterSpawnConfig
// 0x0020 (0x0028 - 0x0008)
struct FBTRandomMonsterSpawnConfig final : public FTableRowBase
{
public:
	TArray<class FString>                         MonsterID;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SpawnCountMax;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnTimexInterval;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRadiusMin;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRadiusMax;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTRandomMonsterSpawnConfig;

// ScriptStruct BroTato.MonsterMaterialArray
// 0x0010 (0x0010 - 0x0000)
struct FMonsterMaterialArray final
{
public:
	TArray<TSoftObjectPtr<class UMaterialInterface>> Materials;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMonsterMaterialArray;

// ScriptStruct BroTato.BTRepairInfo
// 0x0018 (0x0018 - 0x0000)
struct FBTRepairInfo final
{
public:
	EBTStrongholdCampTurretBrokenState            BrokenState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABTPlayerPawn*                          Instigator;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RepairBeginTime;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InstigatorWeaponManualModeFlag;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBTRepairInfo;

// ScriptStruct BroTato.SublvlInfo
// 0x0030 (0x0030 - 0x0000)
struct FSublvlInfo final
{
public:
	TSoftObjectPtr<class UWorld>                  SubLevel;                                          // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSublvlInfo;

// ScriptStruct BroTato.BTEventMonsterWaveConfigBase
// 0x0030 (0x0038 - 0x0008)
struct FBTEventMonsterWaveConfigBase : public FTableRowBase
{
public:
	TArray<class FString>                         MonsterID;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SpawnNumMin;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnNumMax;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRepeatAllowed : 1;                                // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTEventMonsterWaveConfigBase;

// ScriptStruct BroTato.BTEventMonsterWaveConfig
// 0x0008 (0x0040 - 0x0038)
struct FBTEventMonsterWaveConfig : public FBTEventMonsterWaveConfigBase
{
public:
	float                                         Duration;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTEventMonsterWaveConfig;

// ScriptStruct BroTato.BTMonsterInvasionPhaseConfig
// 0x0018 (0x0018 - 0x0000)
struct FBTMonsterInvasionPhaseConfig final
{
public:
	float                                         PhaseStartTime;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBTEventMonsterWaveConfig>      WaveConfig;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTMonsterInvasionPhaseConfig;

// ScriptStruct BroTato.BTAffordMoneyUIStruct
// 0x0010 (0x0010 - 0x0000)
struct FBTAffordMoneyUIStruct final
{
public:
	EBTCoinType                                   CoinType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrHaveValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NeedAffordValue;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanAfford : 1;                                    // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBTAffordMoneyUIStruct;

// ScriptStruct BroTato.MultiMeshResInfo
// 0x0080 (0x0080 - 0x0000)
struct FMultiMeshResInfo final
{
public:
	TSoftObjectPtr<class UStreamableRenderAsset>  MeshRes;                                           // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EDmgType, struct FMonsterMaterialArray>  MeshMaterialRes;                                   // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMultiMeshResInfo;

// ScriptStruct BroTato.BTLightningChainParameters
// 0x0070 (0x0070 - 0x0000)
struct FBTLightningChainParameters final
{
public:
	float                                         BasicDamage;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightningChainDamageFactor;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 LightningChainDamageFactorList;                    // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EBTLightningChainJumpType                     JumpType;                                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         JumpCountMax;                                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IsAllowRepeatJump : 1;                             // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LightningChainFindTargetRadius;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementSpeedBuffFactor;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementSpeedBuffDuration;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DizzinessProbability;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DizzinessDuration;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         IgnoredActors;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                 StartingPointTarget;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        StartingPointTargetComp;                           // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FirstJumpTargetOverride;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        FirstJumpTargetCompOverride;                       // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OwnerWeaponIndex;                                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseOwnerWeaponIndex;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SourceID;                                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBTLightningChainParameters;

// ScriptStruct BroTato.MonsterPermanentBodyEffectsInfo
// 0x0058 (0x0058 - 0x0000)
struct FMonsterPermanentBodyEffectsInfo final
{
public:
	struct FGameplayTag                           EffectTag;                                         // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RelativeLoc;                                       // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRot;                                       // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bUsingAbsoluteScale : 1;                           // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUsingAbsoluteRotation : 1;                        // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bUsingAttachedParentBounds;                        // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBTNiagaraParams>               NiagaraParams;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMonsterPermanentBodyEffectsInfo;

// ScriptStruct BroTato.RagdollDeathAnims
// 0x0008 (0x0008 - 0x0000)
struct FRagdollDeathAnims final
{
public:
	class UAnimMontage*                           Animation;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRagdollDeathAnims;

// ScriptStruct BroTato.RebirthAnims
// 0x0010 (0x0010 - 0x0000)
struct FRebirthAnims final
{
public:
	TArray<class UAnimMontage*>                   AnimationArray;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRebirthAnims;

// ScriptStruct BroTato.WalkAnimWithAnimWalkSpeed
// 0x0010 (0x0010 - 0x0000)
struct FWalkAnimWithAnimWalkSpeed final
{
public:
	class UAnimSequence*                          WalkAnimSequence;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimDefaultWalkSpeed;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWalkAnimWithAnimWalkSpeed;

// ScriptStruct BroTato.ClassReplicationPolicyPreset
// 0x0010 (0x0010 - 0x0000)
struct FClassReplicationPolicyPreset final
{
public:
	TSubclassOf<class AActor>                     Class;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClassRepNodeMapping                          Policy;                                            // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FClassReplicationPolicyPreset;

// ScriptStruct BroTato.NormalMonsterMutationalParams
// 0x0010 (0x0010 - 0x0000)
struct FNormalMonsterMutationalParams final
{
public:
	EDmgType                                      Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BurnDmgFactor;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSpeedDecreasePercent;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
