#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BroTatoCommon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BroTatoCommon_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BroTatoCommon.BTAkAudioManager.Get
// 0x0010 (0x0010 - 0x0000)
struct BTAkAudioManager_Get final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTAkAudioManager*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_Get;

// Function BroTatoCommon.BTAkAudioManager.GetSoundByTag
// 0x0010 (0x0010 - 0x0000)
struct BTAkAudioManager_GetSoundByTag final
{
public:
	struct FGameplayTag                           InSoundTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_GetSoundByTag;

// Function BroTatoCommon.BTAkAudioManager.SaveGameDataInited
// 0x0008 (0x0008 - 0x0000)
struct BTAkAudioManager_SaveGameDataInited final
{
public:
	class UBTDataSaveGame*                        pSaveGameData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_SaveGameDataInited;

// Function BroTatoCommon.BTAkAudioManager.SetVolume_Master
// 0x0004 (0x0004 - 0x0000)
struct BTAkAudioManager_SetVolume_Master final
{
public:
	float                                         InVolume;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_SetVolume_Master;

// Function BroTatoCommon.BTAkAudioManager.SetVolume_Music
// 0x0004 (0x0004 - 0x0000)
struct BTAkAudioManager_SetVolume_Music final
{
public:
	float                                         InVolume;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_SetVolume_Music;

// Function BroTatoCommon.BTAkAudioManager.SetVolume_SFX
// 0x0004 (0x0004 - 0x0000)
struct BTAkAudioManager_SetVolume_SFX final
{
public:
	float                                         InVolume;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTAkAudioManager_SetVolume_SFX;

// Function BroTatoCommon.BTCommonConfig_Game.GetAllModeBaseBriefInfo
// 0x0018 (0x0018 - 0x0000)
struct BTCommonConfig_Game_GetAllModeBaseBriefInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBTModeBaseInfoIntroduce>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonConfig_Game_GetAllModeBaseBriefInfo;

// Function BroTatoCommon.BTCommonConfig_Game.GetTeamRepresentColorByTeamID
// 0x0018 (0x0018 - 0x0000)
struct BTCommonConfig_Game_GetTeamRepresentColorByTeamID final
{
public:
	int32                                         InTeamId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutColor;                                          // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonConfig_Game_GetTeamRepresentColorByTeamID;

// Function BroTatoCommon.BTCommonConfig_Game.SelectModeBaseBriefInfoByID
// 0x0048 (0x0048 - 0x0000)
struct BTCommonConfig_Game_SelectModeBaseBriefInfoByID final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InID;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBTModeBaseInfoIntroduce               OutInfo;                                           // 0x0010(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonConfig_Game_SelectModeBaseBriefInfoByID;

// Function BroTatoCommon.BTCommonFunctionLibrary.BPCall_GetCfg_ItemInfo
// 0x0078 (0x0078 - 0x0000)
struct BTCommonFunctionLibrary_BPCall_GetCfg_ItemInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InID;                                              // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTRB                               ReturnValue;                                       // 0x0010(0x0068)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_BPCall_GetCfg_ItemInfo;

// Function BroTatoCommon.BTCommonFunctionLibrary.BTLoadAsset_Blocking
// 0x0018 (0x0018 - 0x0000)
struct BTCommonFunctionLibrary_BTLoadAsset_Blocking final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_BTLoadAsset_Blocking;

// Function BroTatoCommon.BTCommonFunctionLibrary.DeleteDataGameSave
// 0x0010 (0x0010 - 0x0000)
struct BTCommonFunctionLibrary_DeleteDataGameSave final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_DeleteDataGameSave;

// Function BroTatoCommon.BTCommonFunctionLibrary.GetDataGameSaveByFileName
// 0x0018 (0x0018 - 0x0000)
struct BTCommonFunctionLibrary_GetDataGameSaveByFileName final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTDataSaveGame*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_GetDataGameSaveByFileName;

// Function BroTatoCommon.BTCommonFunctionLibrary.GetItemType
// 0x0008 (0x0008 - 0x0000)
struct BTCommonFunctionLibrary_GetItemType final
{
public:
	int32                                         InID;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemType                                     ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_GetItemType;

// Function BroTatoCommon.BTCommonFunctionLibrary.GetSectType
// 0x0008 (0x0008 - 0x0000)
struct BTCommonFunctionLibrary_GetSectType final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBTSectType                                   ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonFunctionLibrary_GetSectType;

// Function BroTatoCommon.BTCommonGameFlow.CreateNew
// 0x0028 (0x0028 - 0x0000)
struct BTCommonGameFlow_CreateNew final
{
public:
	class UObject*                                InNewObjectOuter;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTGlobalGameInstance*                  InGameInstance;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoSettingReferenced;                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBTCommonGameFlow*                      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_CreateNew;

// Function BroTatoCommon.BTCommonGameFlow.AddFinishEvent_FromDelegate
// 0x0018 (0x0018 - 0x0000)
struct BTCommonGameFlow_AddFinishEvent_FromDelegate final
{
public:
	TDelegate<void(class UBTCommonGameFlow* InCurrentFlow, int32 InAdditionalFlag)> InDelegate;      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTCommonGameFlow*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_AddFinishEvent_FromDelegate;

// Function BroTatoCommon.BTCommonGameFlow.AddLoopStep_FromDelegate
// 0x0020 (0x0020 - 0x0000)
struct BTCommonGameFlow_AddLoopStep_FromDelegate final
{
public:
	uint8                                         InStepId;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBTCommonGameFlow* InCurrentFlow, int32 InAdditionalFlag)> InDelegate;      // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLoopInterval;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTCommonGameFlow*                      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_AddLoopStep_FromDelegate;

// Function BroTatoCommon.BTCommonGameFlow.AddStep_FromDelegate
// 0x0020 (0x0020 - 0x0000)
struct BTCommonGameFlow_AddStep_FromDelegate final
{
public:
	uint8                                         InStepId;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBTCommonGameFlow* InCurrentFlow, int32 InAdditionalFlag)> InDelegate;      // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBTCommonGameFlow*                      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_AddStep_FromDelegate;

// Function BroTatoCommon.BTCommonGameFlow.AddStepChangeEvent_FromDelegate
// 0x0018 (0x0018 - 0x0000)
struct BTCommonGameFlow_AddStepChangeEvent_FromDelegate final
{
public:
	TDelegate<void(class UBTCommonGameFlow* InCurrentFlow, int32 InAdditionalFlag)> InDelegate;      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTCommonGameFlow*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_AddStepChangeEvent_FromDelegate;

// Function BroTatoCommon.BTCommonGameFlow.ContinueFlow
// 0x0004 (0x0004 - 0x0000)
struct BTCommonGameFlow_ContinueFlow final
{
public:
	int32                                         InAdditionalFlag;                                  // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_ContinueFlow;

// Function BroTatoCommon.BTCommonGameFlow.GetCurrentStepId
// 0x0004 (0x0004 - 0x0000)
struct BTCommonGameFlow_GetCurrentStepId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_GetCurrentStepId;

// Function BroTatoCommon.BTCommonGameFlow.IsCurrentStepFirstExecution
// 0x0001 (0x0001 - 0x0000)
struct BTCommonGameFlow_IsCurrentStepFirstExecution final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_IsCurrentStepFirstExecution;

// Function BroTatoCommon.BTCommonGameFlow.JumpTo
// 0x0008 (0x0008 - 0x0000)
struct BTCommonGameFlow_JumpTo final
{
public:
	uint8                                         InStepId;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InAdditionalFlag;                                  // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_JumpTo;

// Function BroTatoCommon.BTCommonGameFlow.StartFlow
// 0x0001 (0x0001 - 0x0000)
struct BTCommonGameFlow_StartFlow final
{
public:
	bool                                          InStartNow;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_StartFlow;

// Function BroTatoCommon.BTCommonGameFlow.GetCurrentStepStartTime
// 0x0004 (0x0004 - 0x0000)
struct BTCommonGameFlow_GetCurrentStepStartTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_GetCurrentStepStartTime;

// Function BroTatoCommon.BTCommonGameFlow.GetDeltaTime
// 0x0004 (0x0004 - 0x0000)
struct BTCommonGameFlow_GetDeltaTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_GetDeltaTime;

// Function BroTatoCommon.BTCommonGameFlow.GetLastStepStartTime
// 0x0004 (0x0004 - 0x0000)
struct BTCommonGameFlow_GetLastStepStartTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_GetLastStepStartTime;

// Function BroTatoCommon.BTCommonGameFlow.IsGameFlowInProgress
// 0x0001 (0x0001 - 0x0000)
struct BTCommonGameFlow_IsGameFlowInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonGameFlow_IsGameFlowInProgress;

// Function BroTatoCommon.BTCommonTable.BPCall_GetAllTalentInfo
// 0x0018 (0x0018 - 0x0000)
struct BTCommonTable_BPCall_GetAllTalentInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTalentTRB>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetAllTalentInfo;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_EnhancedPerkTable
// 0x00D8 (0x00D8 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_EnhancedPerkTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPropTRB                               OutCfg;                                            // 0x0010(0x00C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_EnhancedPerkTable;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_FrontendHeroLevelTable
// 0x0048 (0x0048 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_FrontendHeroLevelTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendHeroLevelTRB                  OutCfg;                                            // 0x0010(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_FrontendHeroLevelTable;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_FrontendItemTable
// 0x0088 (0x0088 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_FrontendItemTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendItemTRB                       OutCfg;                                            // 0x0010(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_FrontendItemTable;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_Skill
// 0x0118 (0x0118 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_Skill final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillTRB                              OutCfg;                                            // 0x0010(0x0100)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0110(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0111(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_Skill;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_TalentTable
// 0x0078 (0x0078 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_TalentTable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTalentTRB                             OutCfg;                                            // 0x0010(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0071(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_TalentTable;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_TowerChapter
// 0x0048 (0x0048 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_TowerChapter final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTowerChapterTRB                       OutCfg;                                            // 0x0010(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_TowerChapter;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_Weapon
// 0x0378 (0x0378 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_Weapon final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponTRB                             OutCfg;                                            // 0x0010(0x0360)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x0370(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0371(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_Weapon;

// Function BroTatoCommon.BTCommonTable.BPCall_GetCfg_WeaponAccessory
// 0x00B0 (0x00B0 - 0x0000)
struct BTCommonTable_BPCall_GetCfg_WeaponAccessory final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponAccessoryTRB                    OutCfg;                                            // 0x0010(0x0098)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIfNotFoundWarning;                                // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetCfg_WeaponAccessory;

// Function BroTatoCommon.BTCommonTable.BPCall_GetDialogueConfig
// 0x0018 (0x0018 - 0x0000)
struct BTCommonTable_BPCall_GetDialogueConfig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDialogueConfig>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetDialogueConfig;

// Function BroTatoCommon.BTCommonTable.BPCall_GetMapInfoConfig
// 0x0018 (0x0018 - 0x0000)
struct BTCommonTable_BPCall_GetMapInfoConfig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FModeMapInfoConfig>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_GetMapInfoConfig;

// Function BroTatoCommon.BTCommonTable.BPCall_SortAllTalentInfo
// 0x0020 (0x0020 - 0x0000)
struct BTCommonTable_BPCall_SortAllTalentInfo final
{
public:
	TArray<struct FTalentTRB>                     SortArray;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTalentTRB>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_BPCall_SortAllTalentInfo;

// Function BroTatoCommon.BTCommonTable.BPGetItemInfoByID
// 0x0078 (0x0078 - 0x0000)
struct BTCommonTable_BPGetItemInfoByID final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTRB                               ReturnValue;                                       // 0x0010(0x0068)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_BPGetItemInfoByID;

// Function BroTatoCommon.BTCommonTable.GetAllHeroInfo
// 0x0018 (0x0018 - 0x0000)
struct BTCommonTable_GetAllHeroInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHeroInfoTRB>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_GetAllHeroInfo;

// Function BroTatoCommon.BTCommonTable.GetDataTableByTag
// 0x0018 (0x0018 - 0x0000)
struct BTCommonTable_GetDataTableByTag final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TableTag;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTCommonTable_GetDataTableByTag;

// Function BroTatoCommon.BTCommonTable.GetItemInfoByID
// 0x0080 (0x0080 - 0x0000)
struct BTCommonTable_GetItemInfoByID final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTRB                               OutCfg;                                            // 0x0010(0x0068)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTCommonTable_GetItemInfoByID;

// Function BroTatoCommon.BTDataSaveGame.GetDataGameSave
// 0x0018 (0x0018 - 0x0000)
struct BTDataSaveGame_GetDataGameSave final
{
public:
	class UObject*                                WorldObj;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckData;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBTDataSaveGame*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetDataGameSave;

// Function BroTatoCommon.BTDataSaveGame.AddAllKillBossNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddAllKillBossNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddAllKillBossNum;

// Function BroTatoCommon.BTDataSaveGame.AddAllKillEliteNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddAllKillEliteNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddAllKillEliteNum;

// Function BroTatoCommon.BTDataSaveGame.AddAllKillNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddAllKillNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddAllKillNum;

// Function BroTatoCommon.BTDataSaveGame.AddContractSuitNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddContractSuitNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddContractSuitNum;

// Function BroTatoCommon.BTDataSaveGame.AddDecomposeNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddDecomposeNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddDecomposeNum;

// Function BroTatoCommon.BTDataSaveGame.AddDoneTaskNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddDoneTaskNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddDoneTaskNum;

// Function BroTatoCommon.BTDataSaveGame.AddGoldCoinNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddGoldCoinNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddGoldCoinNum;

// Function BroTatoCommon.BTDataSaveGame.AddHeavyArmorNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddHeavyArmorNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddHeavyArmorNum;

// Function BroTatoCommon.BTDataSaveGame.AddKillNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddKillNum final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddKillNum;

// Function BroTatoCommon.BTDataSaveGame.AddLightArmorNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddLightArmorNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddLightArmorNum;

// Function BroTatoCommon.BTDataSaveGame.AddMagnetNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddMagnetNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddMagnetNum;

// Function BroTatoCommon.BTDataSaveGame.AddMedicalBagNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddMedicalBagNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddMedicalBagNum;

// Function BroTatoCommon.BTDataSaveGame.AddPerfectDodgeNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddPerfectDodgeNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddPerfectDodgeNum;

// Function BroTatoCommon.BTDataSaveGame.AddRebornTimes
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddRebornTimes final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddRebornTimes;

// Function BroTatoCommon.BTDataSaveGame.AddRefineMaterialNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddRefineMaterialNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddRefineMaterialNum;

// Function BroTatoCommon.BTDataSaveGame.AddRefineNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddRefineNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddRefineNum;

// Function BroTatoCommon.BTDataSaveGame.AddRifle_Kill500AIInTwoMeters
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddRifle_Kill500AIInTwoMeters final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddRifle_Kill500AIInTwoMeters;

// Function BroTatoCommon.BTDataSaveGame.AddSupplyNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddSupplyNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddSupplyNum;

// Function BroTatoCommon.BTDataSaveGame.AddSurveyEventNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddSurveyEventNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddSurveyEventNum;

// Function BroTatoCommon.BTDataSaveGame.AddUseGoldCoinNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddUseGoldCoinNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddUseGoldCoinNum;

// Function BroTatoCommon.BTDataSaveGame.AddWeaponNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_AddWeaponNum final
{
public:
	int32                                         iValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_AddWeaponNum;

// Function BroTatoCommon.BTDataSaveGame.EquipDragOperation
// 0x0028 (0x0028 - 0x0000)
struct BTDataSaveGame_EquipDragOperation final
{
public:
	EDragType                                     SouseType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SouseDragItemID;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSousePos;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDragType                                     TargetType;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetDragItemID;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTargetPos;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldObj;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bQuick;                                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BTDataSaveGame_EquipDragOperation;

// Function BroTatoCommon.BTDataSaveGame.EquipQuickOperation
// 0x0018 (0x0018 - 0x0000)
struct BTDataSaveGame_EquipQuickOperation final
{
public:
	EDragType                                     SouseType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SouseDragItemID;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDragType                                     TargetType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldObj;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_EquipQuickOperation;

// Function BroTatoCommon.BTDataSaveGame.GetAllKillBossNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_GetAllKillBossNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetAllKillBossNum;

// Function BroTatoCommon.BTDataSaveGame.GetAllKillEliteNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_GetAllKillEliteNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetAllKillEliteNum;

// Function BroTatoCommon.BTDataSaveGame.GetAllKillNum
// 0x0004 (0x0004 - 0x0000)
struct BTDataSaveGame_GetAllKillNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetAllKillNum;

// Function BroTatoCommon.BTDataSaveGame.GetbAllHeroHeathPass300
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbAllHeroHeathPass300 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbAllHeroHeathPass300;

// Function BroTatoCommon.BTDataSaveGame.GetbAllHerosUpGradeForty
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbAllHerosUpGradeForty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbAllHerosUpGradeForty;

// Function BroTatoCommon.BTDataSaveGame.GetbAllHerosWithFullEquip
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbAllHerosWithFullEquip final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbAllHerosWithFullEquip;

// Function BroTatoCommon.BTDataSaveGame.GetbAmmoTechToTen
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbAmmoTechToTen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbAmmoTechToTen;

// Function BroTatoCommon.BTDataSaveGame.GetbCompleteEquip
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbCompleteEquip final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbCompleteEquip;

// Function BroTatoCommon.BTDataSaveGame.GetbDamageValuePass20000
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbDamageValuePass20000 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbDamageValuePass20000;

// Function BroTatoCommon.BTDataSaveGame.GetbDarkGoldEquip
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbDarkGoldEquip final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbDarkGoldEquip;

// Function BroTatoCommon.BTDataSaveGame.GetbEmpowermentTechToTen
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbEmpowermentTechToTen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbEmpowermentTechToTen;

// Function BroTatoCommon.BTDataSaveGame.GetbEpicEquip
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbEpicEquip final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BTDataSaveGame_GetbEpicEquip;

// Function BroTatoCommon.BTDataSaveGame.GetbHappyHamster
// 0x0001 (0x0001 - 0x0000)
struct BTDataSaveGame_GetbHappyHamster final
{
public:
