#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTCommonUIModule

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "BTCommonUIModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BTCommonUIModule.ZWBaseRadioBtnWG
// 0x0010 (0x02F0 - 0x02E0)
class UZWBaseRadioBtnWG final : public UUserWidget
{
public:
	class UZWNormalRadioButtonCanvas*             RadioBT;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         nID;                                               // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UObject* GetResourceObject(TSoftObjectPtr<class UObject> InObjectPtr);
	void SetSelected(bool bsel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWBaseRadioBtnWG")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWBaseRadioBtnWG")
	}
	static class UZWBaseRadioBtnWG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWBaseRadioBtnWG>();
	}
};
DUMPER7_ASSERTS_UZWBaseRadioBtnWG;

// Class BTCommonUIModule.ZWImage
// 0x01F0 (0x04D0 - 0x02E0)
class UZWImage final : public UImage
{
public:
	bool                                          UnSelectHide;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0xF];                                      // 0x02E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomImageStyle                      SelectStyle;                                       // 0x02F0(0x00F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCustomImageStyle                      PressStyle;                                        // 0x03E0(0x00F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWImage")
	}
	static class UZWImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWImage>();
	}
};
DUMPER7_ASSERTS_UZWImage;

// Class BTCommonUIModule.ZWNormalButtonCanvas
// 0x04A0 (0x0640 - 0x01A0)
class UZWNormalButtonCanvas : public UCanvasPanel
{
public:
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateWidgetStyleAsset*                 Style;                                             // 0x01B0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           WidgetStyle;                                       // 0x01C0(0x03F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x05B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BackgroundColor;                                   // 0x05C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonClickMethod                            ClickMethod;                                       // 0x05D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonTouchMethod                            TouchMethod;                                       // 0x05D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonPressMethod                            PressMethod;                                       // 0x05D2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x05D3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 nID)>     OnClicked;                                         // 0x05D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnPressed;                                         // 0x05E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnReleased;                                        // 0x05F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnHovered;                                         // 0x0608(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnUnhovered;                                       // 0x0618(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         nID;                                               // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62C[0x14];                                     // 0x062C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);
	void SetClickMethod(EButtonClickMethod InClickMethod);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetPressMethod(EButtonPressMethod InPressMethod);
	void SetStyle(const struct FButtonStyle& InStyle);
	void SetTouchMethod(EButtonTouchMethod InTouchMethod);

	bool IsPressed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWNormalButtonCanvas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWNormalButtonCanvas")
	}
	static class UZWNormalButtonCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWNormalButtonCanvas>();
	}
};
DUMPER7_ASSERTS_UZWNormalButtonCanvas;

// Class BTCommonUIModule.ZWNormalRadioButtonCanvas
// 0x0510 (0x0B50 - 0x0640)
class UZWNormalRadioButtonCanvas final : public UZWNormalButtonCanvas
{
public:
	struct FButtonStyle                           SelectedStyle;                                     // 0x0640(0x03F0)(NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnSelected;                                        // 0x0A30(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 nID)>     OnUnSelected;                                      // 0x0A40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A51[0xF];                                      // 0x0A51(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectBrush;                                       // 0x0A60(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bCheckBox;                                         // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCustomSetSelected : 1;                            // 0x0B31(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B32[0x6];                                      // 0x0B32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ParentWG;                                          // 0x0B38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelWidget*                           ParentWGParentPanel;                               // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B48[0x8];                                      // 0x0B48(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetSelected();
	void NormalStyle();
	void SelectStyle();
	void SetSelectBrush(const struct FSlateBrush& InBrush);
	void SetSelected(bool bInSelected);
	void SetSelectStyleOnly(bool bInSelected);
	void SetStyleByBrush(const struct FSlateBrush& InBrush);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWNormalRadioButtonCanvas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWNormalRadioButtonCanvas")
	}
	static class UZWNormalRadioButtonCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWNormalRadioButtonCanvas>();
	}
};
DUMPER7_ASSERTS_UZWNormalRadioButtonCanvas;

// Class BTCommonUIModule.ZWRadioCustomStyleInterface
// 0x0000 (0x0000 - 0x0000)
class IZWRadioCustomStyleInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWRadioCustomStyleInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWRadioCustomStyleInterface")
	}
	static class IZWRadioCustomStyleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IZWRadioCustomStyleInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IZWRadioCustomStyleInterface;

// Class BTCommonUIModule.ZWRichTextBlockDecorator
// 0x0000 (0x0028 - 0x0028)
class UZWRichTextBlockDecorator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWRichTextBlockDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWRichTextBlockDecorator")
	}
	static class UZWRichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWRichTextBlockDecorator>();
	}
};
DUMPER7_ASSERTS_UZWRichTextBlockDecorator;

// Class BTCommonUIModule.ZWTextBlock
// 0x0860 (0x0A00 - 0x01A0)
class UZWTextBlock final : public UTextLayoutWidget
{
public:
	uint8                                         Pad_1A0[0x8];                                      // 0x01A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x01A8(0x0010)(Edit, NativeAccessSpecifierPublic)
	TDelegate<void()>                             TextDelegate;                                      // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ColorAndOpacity;                                   // 0x01C8(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ColorAndOpacityDelegate;                           // 0x01DC(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x01F0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StrikeBrush;                                       // 0x0250(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                              ShadowOffset;                                      // 0x0320(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x0330(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ShadowColorAndOpacityDelegate;                     // 0x0340(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDesiredWidth;                                   // 0x0350(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWrapWithInvalidationPanel;                        // 0x0354(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoWrapText;                                     // 0x0355(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0356(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimpleTextMode;                                   // 0x0357(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UnSelectHide;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomTextStyle                       SelectStyle;                                       // 0x0370(0x0180)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCustomTextStyle                       PressStyle;                                        // 0x04F0(0x0180)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UDataTable*                             TextStyleSet;                                      // 0x0670(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UZWRichTextBlockDecorator>> DecoratorClasses;                           // 0x0678(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        DefaultTextStyle;                                  // 0x0690(0x0340)(Transient, NativeAccessSpecifierPublic)
	TArray<class UZWRichTextBlockDecorator*>      InstanceDecorators;                                // 0x09D0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E0[0x20];                                     // 0x09E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMaterialInstanceDynamic* GetDynamicFontMaterial();
	class UMaterialInstanceDynamic* GetDynamicOutlineMaterial();
	void SetAutoWrapText(bool InAutoTextWrap);
	void SetColorAndOpacity(const struct FSlateColor& InColorAndOpacity);
	void SetFont(const struct FSlateFontInfo& InFontInfo);
	void SetMinDesiredWidth(float InMinDesiredWidth);
	void SetOpacity(float InOpacity);
	void SetShadowColorAndOpacity(const struct FLinearColor& InShadowColorAndOpacity);
	void SetShadowOffset(const struct FVector2D& InShadowOffset);
	void SetStrikeBrush(const struct FSlateBrush& InStrikeBrush);
	void SetText(const class FText& InText);
	void SetTextTransformPolicy(ETextTransformPolicy InTransformPolicy);

	class FText GetText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZWTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZWTextBlock")
	}
	static class UZWTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZWTextBlock>();
	}
};
DUMPER7_ASSERTS_UZWTextBlock;

}

