#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTPlayer_ABP_Female_Final

#include "Basic.hpp"

#include "BTPlayer_ABP_Female_Final_structs.hpp"
#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C
// 0x2FC0 (0x3430 - 0x0470)
class UBTPlayer_ABP_Female_Final_C final : public UBTPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BTPlayer_ABP_Female_Final::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;    // 0x0478(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0488(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0490(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0498(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0550(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0570(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0590(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x05B0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0668(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0688(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0740(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0760(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0780(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x07A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x07C0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0878(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0950(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0970(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x0990(0x0100)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0A90(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0AB0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0AF8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0BE8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0C30(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x0C50(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0CD0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0CF8(0x0020)()
	uint8                                         Pad_D18[0x8];                                      // 0x0D18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x0D20(0x0440)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x11B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x11D8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0x1200(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x12C8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0x12E8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x13B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x13D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x13F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x14C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x14E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x1510(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x1538(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1600(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1648(0x00F0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x1738(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1800(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1820(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1848(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x1868(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x1930(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x19F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1A40(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x1A60(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1B28(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1B70(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1C60(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1CA8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x1CD0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x1D98(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1E60(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1E80(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1F48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1F68(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2030(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2050(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2078(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x20A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x20C0(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x21E8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2230(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x22B0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x22F8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x2340(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2458(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x24D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2520(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2548(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2570(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x25B8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2680(0x0080)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x2700(0x0280)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x2980(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2AB8(0x0020)()
	uint8                                         Pad_2AD8[0x8];                                     // 0x2AD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x2AE0(0x0280)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x2D60(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2E28(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2E70(0x0440)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x32B0(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x32F8(0x00C8)()
	double                                        __CustomProperty_Stride__Scale_9BB02FD04095BA32AB39D9B08E433F00; // 0x33C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Speed_Force_9BB02FD04095BA32AB39D9B08E433F00; // 0x33C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Large_SpeedIn_Battling_76A4A30E481971F02427F08A3543477D; // 0x33D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D1[0x7];                                     // 0x33D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Stride_Scale_76A4A30E481971F02427F08A3543477D; // 0x33D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SpeedScale_76A4A30E481971F02427F08A3543477D; // 0x33E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Angle_76A4A30E481971F02427F08A3543477D; // 0x33E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SpeedScale_Dying_7437369743ACC39048FCDBB472E606F8; // 0x33F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Stride_Scale_4F8A32674F3F5C8A8E70CDBD5CFDAAA9; // 0x33F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SpeedForce_4F8A32674F3F5C8A8E70CDBD5CFDAAA9; // 0x3400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_LargeSpeedInBattling_C06EEA2B4DE80AD3145F11B714FA5868; // 0x3408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3409[0x7];                                     // 0x3409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_StrideScale_C06EEA2B4DE80AD3145F11B714FA5868; // 0x3410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SpeedScale_C06EEA2B4DE80AD3145F11B714FA5868; // 0x3418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Angle_C06EEA2B4DE80AD3145F11B714FA5868; // 0x3420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BTPlayer_ABP_Female_Final_AnimGraphNode_TransitionResult_1E8D69274BAC814DE14371BB52E65819();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BTPlayer_ABP_Female_Final_AnimGraphNode_TransitionResult_96F310A94D3C79F237A015B7A4C79761();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BTPlayer_ABP_Female_Final_AnimGraphNode_TransitionResult_AEEAFEE84F4872829B5EEA87CFA1C9C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BTPlayer_ABP_Female_Final_AnimGraphNode_TransitionResult_FABC60F0471E5F0DECFAED9B5511A809();
	void ExecuteUbergraph_BTPlayer_ABP_Female_Final(int32 EntryPoint);
	void Locomotion_Idle(struct FPoseLink* Locomotion_Idle_0);
	void Locomotion_Idle_Dying(struct FPoseLink* Locomotion_Idle_Dying_0);
	void Locomotion_Jump(struct FPoseLink* Locomotion_Jump_0);
	void Locomotion_JumpEnd(struct FPoseLink* Locomotion_JumpEnd_0);
	void Locomotion_Run(const struct FPoseLink& InPose, double Angle_0, double SpeedScale_0, double StrideScale_0, bool LargeSpeedInBattling, struct FPoseLink* Locomotion_Run_0);
	void Locomotion_Run_Dying(const struct FPoseLink& InPose_dying, double SpeedScale_Dying, struct FPoseLink* Locomotion_Run_Dying_0);
	void Locomotion_Run_fast_loop(const struct FPoseLink& InPose_1, double SpeedForce_0, double Stride_Scale, struct FPoseLink* Locomotion_Run_fast_loop_0);
	void Locomotion_Run_fast_start(const struct FPoseLink& InPose_5, double Speed_Force, double Stride__Scale, struct FPoseLink* Locomotion_Run_fast_start_0);
	void Locomotion_Run_fast_stop(struct FPoseLink* Locomotion_Run_fast_stop_0);
	void Locomotion_Run_Start(const struct FPoseLink& InPose_0, double Angle_0, double SpeedScale_0, double Stride_Scale, bool Large_SpeedIn_Battling, struct FPoseLink* Locomotion_Run_Start_0);
	void Locomotion_Run_Stop(struct FPoseLink* Locomotion_Run_Stop_0);
	void MGTower_idle(struct FPoseLink* MGTower_idle_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTPlayer_ABP_Female_Final_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTPlayer_ABP_Female_Final_C")
	}
	static class UBTPlayer_ABP_Female_Final_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTPlayer_ABP_Female_Final_C>();
	}
};
DUMPER7_ASSERTS_UBTPlayer_ABP_Female_Final_C;

}

