#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTPlayerAnimationLinkInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Idle
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Idle final
{
public:
	struct FPoseLink                              Locomotion_Idle_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Idle;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Idle_Dying
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Idle_Dying final
{
public:
	struct FPoseLink                              Locomotion_Idle_Dying_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Idle_Dying;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Jump
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Jump final
{
public:
	struct FPoseLink                              Locomotion_Jump_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Jump;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_JumpEnd
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_JumpEnd final
{
public:
	struct FPoseLink                              Locomotion_JumpEnd_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_JumpEnd;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run
// 0x0040 (0x0040 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Angle;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedScale;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideScale;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeSpeedInBattling;                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Locomotion_Run_0;                                  // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_Dying
// 0x0028 (0x0028 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_Dying final
{
public:
	struct FPoseLink                              InPose_dying;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedScale_Dying;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_Dying_0;                            // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_Dying;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_fast_loop
// 0x0030 (0x0030 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_loop final
{
public:
	struct FPoseLink                              InPose_1;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedForce;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride_Scale;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_fast_loop_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_loop;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_fast_start
// 0x0030 (0x0030 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_start final
{
public:
	struct FPoseLink                              InPose_5;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Speed_Force;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride__Scale;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_fast_start_0;                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_start;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_fast_stop
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_stop final
{
public:
	struct FPoseLink                              Locomotion_Run_fast_stop_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_fast_stop;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_Start
// 0x0040 (0x0040 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_Start final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Angle;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedScale;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride_Scale;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Large_SpeedIn_Battling;                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Locomotion_Run_Start_0;                            // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_Start;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.Locomotion_Run_Stop
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_Locomotion_Run_Stop final
{
public:
	struct FPoseLink                              Locomotion_Run_Stop_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_Locomotion_Run_Stop;

// Function BTPlayerAnimationLinkInterface.BTPlayerAnimationLinkInterface_C.MGTower_idle
// 0x0010 (0x0010 - 0x0000)
struct BTPlayerAnimationLinkInterface_C_MGTower_idle final
{
public:
	struct FPoseLink                              MGTower_idle_0;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayerAnimationLinkInterface_C_MGTower_idle;

}

