#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTPlayer_ABP_Female_Final

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_AnimGraph;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.ExecuteUbergraph_BTPlayer_ABP_Female_Final
// 0x000C (0x000C - 0x0000)
struct BTPlayer_ABP_Female_Final_C_ExecuteUbergraph_BTPlayer_ABP_Female_Final final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_ExecuteUbergraph_BTPlayer_ABP_Female_Final;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Idle
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Idle final
{
public:
	struct FPoseLink                              Locomotion_Idle_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Idle;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Idle_Dying
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Idle_Dying final
{
public:
	struct FPoseLink                              Locomotion_Idle_Dying_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Idle_Dying;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Jump
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Jump final
{
public:
	struct FPoseLink                              Locomotion_Jump_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Jump;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_JumpEnd
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_JumpEnd final
{
public:
	struct FPoseLink                              Locomotion_JumpEnd_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_JumpEnd;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run
// 0x0040 (0x0040 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Angle_0;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedScale_0;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideScale_0;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeSpeedInBattling;                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Locomotion_Run_0;                                  // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_Dying
// 0x0028 (0x0028 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_Dying final
{
public:
	struct FPoseLink                              InPose_dying;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedScale_Dying;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_Dying_0;                            // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_Dying;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_fast_loop
// 0x0030 (0x0030 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_loop final
{
public:
	struct FPoseLink                              InPose_1;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedForce_0;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride_Scale;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_fast_loop_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_loop;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_fast_start
// 0x0030 (0x0030 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_start final
{
public:
	struct FPoseLink                              InPose_5;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Speed_Force;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride__Scale;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Locomotion_Run_fast_start_0;                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_start;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_fast_stop
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_stop final
{
public:
	struct FPoseLink                              Locomotion_Run_fast_stop_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_fast_stop;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_Start
// 0x0040 (0x0040 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_Start final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Angle_0;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedScale_0;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stride_Scale;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Large_SpeedIn_Battling;                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Locomotion_Run_Start_0;                            // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_Start;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.Locomotion_Run_Stop
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_Locomotion_Run_Stop final
{
public:
	struct FPoseLink                              Locomotion_Run_Stop_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_Locomotion_Run_Stop;

// Function BTPlayer_ABP_Female_Final.BTPlayer_ABP_Female_Final_C.MGTower_idle
// 0x0010 (0x0010 - 0x0000)
struct BTPlayer_ABP_Female_Final_C_MGTower_idle final
{
public:
	struct FPoseLink                              MGTower_idle_0;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_BTPlayer_ABP_Female_Final_C_MGTower_idle;

}

