#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllableMachineGunTowerABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ControllableMachineGunTowerABP.ControllableMachineGunTowerABP_C
// 0x0360 (0x06F0 - 0x0390)
class UControllableMachineGunTowerABP_C final : public UControllableMachineGunTowerAnimIns
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0398(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03C8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0410(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0538(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0660(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0680(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06C8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ControllableMachineGunTowerABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ControllableMachineGunTowerABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControllableMachineGunTowerABP_C")
	}
	static class UControllableMachineGunTowerABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllableMachineGunTowerABP_C>();
	}
};
DUMPER7_ASSERTS_UControllableMachineGunTowerABP_C;

}

