#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeathAngelABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeathAngelABP_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DeathAngelABP.DeathAngelABP_C
// 0x0330 (0x0860 - 0x0530)
class UDeathAngelABP_C final : public UBTAIAnimIns_DeathAngel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct DeathAngelABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                // 0x0538(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0540(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0548(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0550(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0570(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x05B8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0600(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0728(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0748(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0768(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x07F8(0x0048)()
	struct FVector                                Translation;                                       // 0x0840(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_DeathAngelABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DeathAngelABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeathAngelABP_C")
	}
	static class UDeathAngelABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathAngelABP_C>();
	}
};
DUMPER7_ASSERTS_UDeathAngelABP_C;

}

