#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecoyBounceStickyTimedBomb

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DecoyBounceStickyTimedBomb.DecoyBounceStickyTimedBomb_C
// 0x0040 (0x0678 - 0x0638)
class ADecoyBounceStickyTimedBomb_C : public ABTDecoyStickyTimedMissile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Timeline_1_NewTrack_1_7A9D2D6E48BC7FE7AB97B2B41247B03D; // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_2_7A9D2D6E48BC7FE7AB97B2B41247B03D; // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_7A9D2D6E48BC7FE7AB97B2B41247B03D; // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D[0x3];                                      // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        In_Camera_Shake_Strength;                          // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        In_Camera_Shake_Radius;                            // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClientExplosion();
	void ExecuteUbergraph_DecoyBounceStickyTimedBomb(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DecoyBounceStickyTimedBomb_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DecoyBounceStickyTimedBomb_C")
	}
	static class ADecoyBounceStickyTimedBomb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADecoyBounceStickyTimedBomb_C>();
	}
};
DUMPER7_ASSERTS_ADecoyBounceStickyTimedBomb_C;

}

