#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DecoyBounceStickyTimedBomb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DecoyBounceStickyTimedBomb.DecoyBounceStickyTimedBomb_C.ExecuteUbergraph_DecoyBounceStickyTimedBomb
// 0x0028 (0x0028 - 0x0000)
struct DecoyBounceStickyTimedBomb_C_ExecuteUbergraph_DecoyBounceStickyTimedBomb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayCameraShakeAtLocation_InCameraShakeStrength_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayCameraShakeAtLocation_InCameraShakeRadius_ImplicitCast; // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DecoyBounceStickyTimedBomb_C_ExecuteUbergraph_DecoyBounceStickyTimedBomb;

}

