#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntsABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "EntsABP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EntsABP.EntsABP_C
// 0x0170 (0x0650 - 0x04E0)
class UEntsABP_C final : public UBTAIAnimIns_Ents
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct EntsABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                      // 0x04E8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0500(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0508(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0528(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0570(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0600(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_EntsABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EntsABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntsABP_C")
	}
	static class UEntsABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntsABP_C>();
	}
};
DUMPER7_ASSERTS_UEntsABP_C;

}

