#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingZombieBugABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FlyingZombieBugABP.FlyingZombieBugABP_C
// 0x0110 (0x05B0 - 0x04A0)
class UFlyingZombieBugABP_C final : public UBTAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04B8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x04D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0520(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0568(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_FlyingZombieBugABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FlyingZombieBugABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlyingZombieBugABP_C")
	}
	static class UFlyingZombieBugABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlyingZombieBugABP_C>();
	}
};
DUMPER7_ASSERTS_UFlyingZombieBugABP_C;

}

