#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Layer_Female

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Frontend_Layer_Female_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Frontend_Layer_Female.Frontend_Layer_Female_C
// 0x0370 (0x06E0 - 0x0370)
class UFrontend_Layer_Female_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Frontend_Layer_Female::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0378(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0398(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x03B8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0400(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0420(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0468(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0520(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0540(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0588(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0640(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0660(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	double                                        Rate;                                              // 0x06C8(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpeedRate;                                         // 0x06D0(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Frontend_Layer_Female(int32 EntryPoint);
	void idle(struct FPoseLink* idle_0);
	void LoopMoving(const struct FPoseLink& InPose_0, double SpeedRate_0, struct FPoseLink* LoopMoving_0);
	void StartMove(const struct FPoseLink& InPose, double Rate_0, struct FPoseLink* StartMove_0);
	void StopMoving(struct FPoseLink* StopMoving_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Frontend_Layer_Female_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Frontend_Layer_Female_C")
	}
	static class UFrontend_Layer_Female_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontend_Layer_Female_C>();
	}
};
DUMPER7_ASSERTS_UFrontend_Layer_Female_C;

}

