#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendPlayerBaseLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FrontendPlayerBaseLayer.FrontendPlayerBaseLayer_C.idle
// 0x0010 (0x0010 - 0x0000)
struct FrontendPlayerBaseLayer_C_idle final
{
public:
	struct FPoseLink                              idle_0;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FrontendPlayerBaseLayer_C_idle;

// Function FrontendPlayerBaseLayer.FrontendPlayerBaseLayer_C.LoopMoving
// 0x0028 (0x0028 - 0x0000)
struct FrontendPlayerBaseLayer_C_LoopMoving final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedRate;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              LoopMoving_0;                                      // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FrontendPlayerBaseLayer_C_LoopMoving;

// Function FrontendPlayerBaseLayer.FrontendPlayerBaseLayer_C.StartMove
// 0x0028 (0x0028 - 0x0000)
struct FrontendPlayerBaseLayer_C_StartMove final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Rate;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              StartMove_0;                                       // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FrontendPlayerBaseLayer_C_StartMove;

// Function FrontendPlayerBaseLayer.FrontendPlayerBaseLayer_C.StopMoving
// 0x0010 (0x0010 - 0x0000)
struct FrontendPlayerBaseLayer_C_StopMoving final
{
public:
	struct FPoseLink                              StopMoving_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FrontendPlayerBaseLayer_C_StopMoving;

}

