#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Layer_Female

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Layer_Female_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_AnimGraph;

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.ExecuteUbergraph_Frontend_Layer_Female
// 0x0004 (0x0004 - 0x0000)
struct Frontend_Layer_Female_C_ExecuteUbergraph_Frontend_Layer_Female final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_ExecuteUbergraph_Frontend_Layer_Female;

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.idle
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Layer_Female_C_idle final
{
public:
	struct FPoseLink                              idle_0;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_idle;

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.LoopMoving
// 0x0028 (0x0028 - 0x0000)
struct Frontend_Layer_Female_C_LoopMoving final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        SpeedRate_0;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              LoopMoving_0;                                      // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_LoopMoving;

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.StartMove
// 0x0028 (0x0028 - 0x0000)
struct Frontend_Layer_Female_C_StartMove final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Rate_0;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              StartMove_0;                                       // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_StartMove;

// Function Frontend_Layer_Female.Frontend_Layer_Female_C.StopMoving
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Layer_Female_C_StopMoving final
{
public:
	struct FPoseLink                              StopMoving_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_Frontend_Layer_Female_C_StopMoving;

}

