#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendPlayerBaseABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "FrontendPlayerBaseABP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FrontendPlayerBaseABP.FrontendPlayerBaseABP_C
// 0x0D40 (0x10C0 - 0x0380)
class UFrontendPlayerBaseABP_C final : public UFrontentPlayerAnimIns
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FrontendPlayerBaseABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0388(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x03A0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x03E0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0498(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04B8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0570(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0590(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x05B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0678(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x06A0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0768(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x0788(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0850(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x0870(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0938(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0958(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A40(0x00C8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0B08(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C20(0x0048)()
	uint8                                         Pad_C68[0x8];                                      // 0x0C68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0C70(0x0440)()
	double                                        __CustomProperty_SpeedRate_C195E51648CE20CA162BAFB9921C316C; // 0x10B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Rate_C39D648E463B3B8571BB19B749002FE5; // 0x10B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_FrontendPlayerBaseABP(int32 EntryPoint);
	void idle(struct FPoseLink* idle_0);
	void LoopMoving(const struct FPoseLink& InPose_0, double SpeedRate, struct FPoseLink* LoopMoving_0);
	void StartMove(const struct FPoseLink& InPose, double Rate, struct FPoseLink* StartMove_0);
	void StopMoving(struct FPoseLink* StopMoving_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FrontendPlayerBaseABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FrontendPlayerBaseABP_C")
	}
	static class UFrontendPlayerBaseABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontendPlayerBaseABP_C>();
	}
};
DUMPER7_ASSERTS_UFrontendPlayerBaseABP_C;

}

