#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KawaiiPhysics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK::Params
{

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.Apply
// 0x0950 (0x0950 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_Apply final
{
public:
	struct FAnimNode_KawaiiPhysics                Node;                                              // 0x0000(0x08E0)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ModifyBoneIndex;                                   // 0x08E0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USkeletalMeshComponent*           SkelComp;                                          // 0x08E8(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             BoneTransform;                                     // 0x08F0(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysics_CustomExternalForce_Apply;

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.IsDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_IsDebugEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysics_CustomExternalForce_IsDebugEnabled;

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.PreApply
// 0x08F0 (0x08F0 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_PreApply final
{
public:
	struct FAnimNode_KawaiiPhysics                Node;                                              // 0x0000(0x08E0)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	const class USkeletalMeshComponent*           SkelComp;                                          // 0x08E0(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E8[0x8];                                      // 0x08E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysics_CustomExternalForce_PreApply;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForce
// 0x0030 (0x0030 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForce final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ExternalForce;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_AddExternalForce;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForcesToComponent
// 0x0048 (0x0048 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForcesToComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ExternalForces;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0020(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFilterExactMatch;                                 // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0041(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0042(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_AddExternalForcesToComponent;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForceWithExecResult
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForceWithExecResult final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ExternalForce;                                     // 0x0018(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_AddExternalForceWithExecResult;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ConvertToKawaiiPhysics
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_ConvertToKawaiiPhysics final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_ConvertToKawaiiPhysics;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ConvertToKawaiiPhysicsPure
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetAllowWorldCollision
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetAllowWorldCollision final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetAllowWorldCollision;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetDummyBoneLength
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetDummyBoneLength final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetDummyBoneLength;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetEnableWind
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetEnableWind final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetEnableWind;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExcludeBoneNames
// 0x0020 (0x0020 - 0x0000)
struct KawaiiPhysicsLibrary_GetExcludeBoneNames final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExcludeBoneNames;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceBoolProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceBoolProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceBoolProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceFloatProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceFloatProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceFloatProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceIntProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceIntProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceIntProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceRotatorProperty
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceRotatorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceRotatorProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceTransformProperty
// 0x0090 (0x0090 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceTransformProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0030(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceTransformProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceVectorProperty
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceVectorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceVectorProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceWildcardProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceWildcardProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetExternalForceWildcardProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetGravity
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetGravity final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetGravity;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetLimitsDataAsset
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetLimitsDataAsset final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UKawaiiPhysicsLimitsDataAsset*          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetLimitsDataAsset;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetNeedWarmUp
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetNeedWarmUp final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetNeedWarmUp;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetPhysicsSettings
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetPhysicsSettings final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsSettings                 ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetPhysicsSettings;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetRootBoneName
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetRootBoneName final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetRootBoneName;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetTeleportDistanceThreshold
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetTeleportDistanceThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetTeleportDistanceThreshold;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetTeleportRotationThreshold
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetTeleportRotationThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetTeleportRotationThreshold;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetWindScale
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetWindScale final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_GetWindScale;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.RemoveExternalForcesFromComponent
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0010(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFilterExactMatch;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ResetDynamics
// 0x0020 (0x0020 - 0x0000)
struct KawaiiPhysicsLibrary_ResetDynamics final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_ResetDynamics;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetAllowWorldCollision
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetAllowWorldCollision final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAllowWorldCollision;                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetAllowWorldCollision;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetDummyBoneLength
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetDummyBoneLength final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DummyBoneLength;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetDummyBoneLength;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetEnableWind
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetEnableWind final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableWind;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetEnableWind;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExcludeBoneNames
// 0x0030 (0x0030 - 0x0000)
struct KawaiiPhysicsLibrary_SetExcludeBoneNames final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludeBoneNames;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExcludeBoneNames;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceBoolProperty
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceBoolProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceBoolProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceFloatProperty
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceFloatProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceFloatProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceIntProperty
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceIntProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceIntProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceRotatorProperty
// 0x0050 (0x0050 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceRotatorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Value;                                             // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceRotatorProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceTransformProperty
// 0x00A0 (0x00A0 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceTransformProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0090(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceTransformProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceVectorProperty
// 0x0050 (0x0050 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceVectorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceVectorProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetExternalForceWildcardProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetExternalForceWildcardProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0024(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetExternalForceWildcardProperty;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetGravity
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_SetGravity final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetGravity;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetLimitsDataAsset
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetLimitsDataAsset final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UKawaiiPhysicsLimitsDataAsset*          LimitsDataAsset;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetLimitsDataAsset;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetNeedWarmUp
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetNeedWarmUp final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bNeedWarmUp;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetNeedWarmUp;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetPhysicsSettings
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_SetPhysicsSettings final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsSettings                 PhysicsSettings;                                   // 0x0010(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetPhysicsSettings;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetRootBoneName
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetRootBoneName final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   RootBoneName;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetRootBoneName;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetTeleportDistanceThreshold
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetTeleportDistanceThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TeleportDistanceThreshold;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetTeleportDistanceThreshold;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetTeleportRotationThreshold
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetTeleportRotationThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TeleportRotationThreshold;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetTeleportRotationThreshold;

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetWindScale
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetWindScale final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WindScale;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KawaiiPhysicsLibrary_SetWindScale;

}

