#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// Class LoadingScreen.LoadingBG
// 0x0048 (0x0328 - 0x02E0)
class ULoadingBG : public UUserWidget
{
public:
	class UImage*                                 Image_BG;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_Tips;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_Map;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_Progress;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ProgressBar_Pro;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        WidgetSwitcher_Title;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           arr_MapLoadingTips;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	float GetProgressBarPercent();
	void OnProgressUpdated(float Progress);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoadingBG")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadingBG")
	}
	static class ULoadingBG* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingBG>();
	}
};
DUMPER7_ASSERTS_ULoadingBG;

}

