#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeleeComboZombieABP

#include "Basic.hpp"

#include "MeleeComboZombieABP_structs.hpp"
#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MeleeComboZombieABP.MeleeComboZombieABP_C
// 0x0830 (0x0CD0 - 0x04A0)
class UMeleeComboZombieABP_C final : public UBTAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct MeleeComboZombieABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x04A8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B8(0x0008)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x04C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0508(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0550(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0640(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x06C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x06E8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0710(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0758(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07A0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x07C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0810(0x0048)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x0858(0x0100)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0958(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0978(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x09C0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A08(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0A28(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0x0A48(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C90(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0CB0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_MeleeComboZombieABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MeleeComboZombieABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeleeComboZombieABP_C")
	}
	static class UMeleeComboZombieABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeleeComboZombieABP_C>();
	}
};
DUMPER7_ASSERTS_UMeleeComboZombieABP_C;

}

