#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyUtilityTools

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum MyUtilityTools.EMyGameEventType
// NumValues: 0x0020
enum class EMyGameEventType : uint8
{
	MyGameEventType1                         = 0,
	MyGameEventType2                         = 1,
	MyGameEventType3                         = 2,
	MyGameEventType4                         = 3,
	MyGameEventType5                         = 4,
	MyGameEventType6                         = 5,
	MyGameEventType7                         = 6,
	MyGameEventType8                         = 7,
	MyGameEventType9                         = 8,
	MyGameEventType10                        = 9,
	MyGameEventType11                        = 10,
	MyGameEventType12                        = 11,
	MyGameEventType13                        = 12,
	MyGameEventType14                        = 13,
	MyGameEventType15                        = 14,
	MyGameEventType16                        = 15,
	MyGameEventType17                        = 16,
	MyGameEventType18                        = 17,
	MyGameEventType19                        = 18,
	MyGameEventType20                        = 19,
	MyGameEventType21                        = 20,
	MyGameEventType22                        = 21,
	MyGameEventType23                        = 22,
	MyGameEventType24                        = 23,
	MyGameEventType25                        = 24,
	MyGameEventType26                        = 25,
	MyGameEventType27                        = 26,
	MyGameEventType28                        = 27,
	MyGameEventType29                        = 28,
	MyGameEventType30                        = 29,
	MyGameEventType31                        = 30,
	EMyGameEventType_MAX                     = 31,
};

// Enum MyUtilityTools.EMyExcludeModulesType
// NumValues: 0x0012
enum class EMyExcludeModulesType : uint8
{
	None                                     = 0,
	UIAll_InGame                             = 1,
	GameEventManager                         = 2,
	UIControllerChildClass                   = 3,
	NavigationPoint                          = 4,
	NavigationPoint_Dmg                      = 5,
	Loading                                  = 6,
	NoviceGuidance                           = 7,
	Setting                                  = 8,
	UICustomResourceLoad                     = 9,
	Game                                     = 10,
	Game_AIMonster                           = 11,
	Game_AIPlayer                            = 12,
	Game_Effect                              = 13,
	Frontend                                 = 14,
	Frontend_Login_LP                        = 15,
	NDSDK_Login                              = 16,
	Max                                      = 17,
};

// Enum MyUtilityTools.EMyFramePacingMode
// NumValues: 0x0004
enum class EMyFramePacingMode : uint8
{
	DesktopStyle                             = 0,
	ConsoleStyle                             = 1,
	MobileStyle                              = 2,
	EMyFramePacingMode_MAX                   = 3,
};

// Enum MyUtilityTools.EMyStatDisplayMode
// NumValues: 0x0005
enum class EMyStatDisplayMode : uint8
{
	Hidden                                   = 0,
	TextOnly                                 = 1,
	GraphOnly                                = 2,
	TextAndGraph                             = 3,
	EMyStatDisplayMode_MAX                   = 4,
};

// Enum MyUtilityTools.EMyDisplayablePerformanceStat
// NumValues: 0x0011
enum class EMyDisplayablePerformanceStat : uint8
{
	ClientFPS                                = 0,
	ServerFPS                                = 1,
	IdleTime                                 = 2,
	FrameTime                                = 3,
	FrameTime_GameThread                     = 4,
	FrameTime_RenderThread                   = 5,
	FrameTime_RHIThread                      = 6,
	FrameTime_GPU                            = 7,
	Ping                                     = 8,
	PacketLoss_Incoming                      = 9,
	PacketLoss_Outgoing                      = 10,
	PacketRate_Incoming                      = 11,
	PacketRate_Outgoing                      = 12,
	PacketSize_Incoming                      = 13,
	PacketSize_Outgoing                      = 14,
	Count                                    = 15,
	EMyDisplayablePerformanceStat_MAX        = 16,
};

// ScriptStruct MyUtilityTools.MyEventCachedData
// 0x0020 (0x0020 - 0x0000)
struct FMyEventCachedData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UMyGameEvent* Param)>    Delegate;                                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyEventCachedData;

// ScriptStruct MyUtilityTools.MyEventCached
// 0x0010 (0x0010 - 0x0000)
struct FMyEventCached final
{
public:
	TArray<struct FMyEventCachedData>             Data;                                              // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyEventCached;

// ScriptStruct MyUtilityTools.MyEventParamsRecycleData
// 0x0008 (0x0008 - 0x0000)
struct FMyEventParamsRecycleData final
{
public:
	class UMyGameEvent*                           Params;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyEventParamsRecycleData;

// ScriptStruct MyUtilityTools.MyEventParamsRecycleDataCached
// 0x0010 (0x0010 - 0x0000)
struct FMyEventParamsRecycleDataCached final
{
public:
	TArray<class UMyGameEvent*>                   Data;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyEventParamsRecycleDataCached;

// ScriptStruct MyUtilityTools.MyEventCached_ClassParams
// 0x0010 (0x0010 - 0x0000)
struct FMyEventCached_ClassParams final
{
public:
	TArray<class UMyGameEvent*>                   Data;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyEventCached_ClassParams;

// ScriptStruct MyUtilityTools.MyEventFuncNameStruct
// 0x0010 (0x0010 - 0x0000)
struct FMyEventFuncNameStruct final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMyEventFuncNameStruct;

// ScriptStruct MyUtilityTools.LoadedMappableConfigPair
// 0x0010 (0x0010 - 0x0000)
struct FLoadedMappableConfigPair final
{
public:
	class UPlayerMappableInputConfig*             Config;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              Type;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0009(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadedMappableConfigPair;

// ScriptStruct MyUtilityTools.MappableConfigPair
// 0x0078 (0x0078 - 0x0000)
struct FMappableConfigPair final
{
public:
	TSoftObjectPtr<class UPlayerMappableInputConfig> Config;                                         // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              Type;                                              // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DependentPlatformTraits;                           // 0x0030(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ExcludedPlatformTraits;                            // 0x0050(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bShouldActivateAutomatically;                      // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMappableConfigPair;

// ScriptStruct MyUtilityTools.MyRecordVersion
// 0x0048 (0x0048 - 0x0000)
struct FMyRecordVersion final
{
public:
	class FString                                 DevAppVersion;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DevResVersion_Win64;                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DevResVersion_Android;                             // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DevResVersion_IOS;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMyRecordVersion;

// ScriptStruct MyUtilityTools.MyExcludeModuleConfig
// 0x0001 (0x0001 - 0x0000)
struct FMyExcludeModuleConfig final
{
public:
	EMyExcludeModulesType                         BelongTo;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyExcludeModuleConfig;

// ScriptStruct MyUtilityTools.MyQualityDeviceProfileVariant
// 0x0028 (0x0028 - 0x0000)
struct FMyQualityDeviceProfileVariant final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FString                                 DeviceProfileSuffix;                               // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinRefreshRate;                                    // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMyQualityDeviceProfileVariant;

// ScriptStruct MyUtilityTools.MyPerformanceStatGroup
// 0x0098 (0x0098 - 0x0000)
struct FMyPerformanceStatGroup final
{
public:
	struct FGameplayTagQuery                      VisibilityQuery;                                   // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	TSet<EMyDisplayablePerformanceStat>           AllowedStats;                                      // 0x0048(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMyPerformanceStatGroup;

// ScriptStruct MyUtilityTools.MyScalabilitySnapshot
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FMyScalabilitySnapshot final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMyScalabilitySnapshot;

}

