#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyUtilityTools

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "MyUtilityTools_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class MyUtilityTools.MyAssetManager
// 0x00C8 (0x0598 - 0x04D0)
class UMyAssetManager final : public UAssetManager
{
public:
	TMap<class UClass*, class UPrimaryDataAsset*> GameDataMap;                                       // 0x04D0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TSet<class UObject*>                          LoadedAssets;                                      // 0x0520(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_570[0x28];                                     // 0x0570(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAssetManagerCreated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyAssetManager")
	}
	static class UMyAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyAssetManager>();
	}
};
DUMPER7_ASSERTS_UMyAssetManager;

// Class MyUtilityTools.MyCommonConfig_Version
// 0x0058 (0x0080 - 0x0028)
class UMyCommonConfig_Version final : public UObject
{
public:
	struct FMyRecordVersion                       RecordVersion;                                     // 0x0028(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FString                                 SVN_Version;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyCommonConfig_Version")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyCommonConfig_Version")
	}
	static class UMyCommonConfig_Version* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyCommonConfig_Version>();
	}
};
DUMPER7_ASSERTS_UMyCommonConfig_Version;

// Class MyUtilityTools.MyConfig_UtilityTools
// 0x0010 (0x0038 - 0x0028)
class UMyConfig_UtilityTools final : public UObject
{
public:
	TArray<class FName>                           arrMyGameEventTypeComments;                        // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyConfig_UtilityTools")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyConfig_UtilityTools")
	}
	static class UMyConfig_UtilityTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyConfig_UtilityTools>();
	}
};
DUMPER7_ASSERTS_UMyConfig_UtilityTools;

// Class MyUtilityTools.MyConfig_UtilityTools_Client
// 0x0060 (0x0088 - 0x0028)
class UMyConfig_UtilityTools_Client final : public UObject
{
public:
	TMap<EMyExcludeModulesType, struct FMyExcludeModuleConfig> arrExcludeModuleConfig;               // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class FString                                 TestAutomaticProcessClass;                         // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyConfig_UtilityTools_Client")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyConfig_UtilityTools_Client")
	}
	static class UMyConfig_UtilityTools_Client* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyConfig_UtilityTools_Client>();
	}
};
DUMPER7_ASSERTS_UMyConfig_UtilityTools_Client;

// Class MyUtilityTools.MyExcludeModuleSubsystem
// 0x0008 (0x0038 - 0x0030)
class UMyExcludeModuleSubsystem final : public UGameInstanceSubsystem
{
public:
	class UMyNormalSaveGame_ExcludeModule*        SaveGame_ExcludeModule;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyExcludeModuleSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyExcludeModuleSubsystem")
	}
	static class UMyExcludeModuleSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyExcludeModuleSubsystem>();
	}
};
DUMPER7_ASSERTS_UMyExcludeModuleSubsystem;

// Class MyUtilityTools.MyFunctionLibrary_UtilityTools
// 0x0000 (0x0028 - 0x0028)
class UMyFunctionLibrary_UtilityTools final : public UBlueprintFunctionLibrary
{
public:
	static class UMyGameEventManager* BPCall_GetMyEventManager(class UObject* WorldContextObject);
	static void BPCall_ProcessEvent(class UObject* ContextObject, class FName InFunctionName, class UMyGameEvent* InGameEventParams);
	static float CalAngleByYaw(const struct FVector& InTargetLoc, const struct FVector& InOriginLoc, const struct FRotator& InFaceRotation);
	static void ConvertStringToStruct(const class FString& String, int32* OutStruct);
	static class FString ConvertStructToString(const int32& StructData);
	static void EditorSlate_Notification(const class FText& Message, float InDuration);
	static void EnsureAndEditorTip(bool InResult, const class FString& InEnsureMessage, class UObject* WorldContextObject, bool InbPopupSlateNotification);
	static void FormatAsClock(const int32& InSeconds, class FString* OutString);
	static bool GetArrColorsFromConfigIni(const class FString& InSection, const class FString& InPropertyNameKey, const class FString& InFilename, TArray<struct FLinearColor>* OutRes);
	static bool GetArrFromConfigIni(const class FString& InSection, const class FString& InPropertyNameKey, const class FString& InFilename, TArray<class FString>* OutRes);
	static int32 GetBatteryLevel();
	static class FString GetCurrentCultureLanguage();
	static struct FVector2D GetEightPivoftByVector2D(const float& InR, const float& InF);
	static class FString GetEnvironmentVar(const class FString& InKey);
	static struct FIntPoint GetInsideRangeByArrIntPoint(float InfVal, const TArray<struct FIntPoint>& InArrRange);
	static struct FVector2D GetInsideRangeByArrVector2D(float InfVal, const TArray<struct FVector2D>& InArrRange);
	static class ULocalPlayer* GetLocalPlayer(class UObject* WorldContextObject);
	static class UMyNormalSaveGame_ExcludeModule* GetMySaveGame_ExcludeModule(class UObject* WorldContextObject);
	static class UWorld* GetMyWorld(class UObject* WorldContextObject);
	static bool GetStringFromConfigIni(const class FString& InSection, const class FString& InPropertyNameKey, const class FString& InFilename, class FString* OutRes);
	static bool GetTagArrayLastTagName(class UObject* WorldContextObject, const struct FGameplayTag& InTag, class FName* OutName);
	static class FString GetTimestampAsString(int64 UnixTime);
	static class UClass* IsChildClassOfOne(class UClass* InClass, const TArray<TSoftClassPtr<class UClass>>& InArrClasses);
	static bool IsEditorPackage(class UObject* InObject);
	static bool IsInShipping();
	static bool IsNeedExcludeModule(EMyExcludeModulesType InType, class UObject* WorldContextObject);
	static bool IsPlayInCMD();
	static bool IsPlayInEditor();
	static bool IsRuntimeInEditor(class UObject* WorldContextObject);
	static bool IsTestMode(class UObject* WorldContextObject);
	static TMap<EMyExcludeModulesType, bool> LoadAllExcludeModulesHistory(class UObject* WorldContextObject);
	static void MakeMapByTwoArray(TMap<int32, int32>* OutMap, const TArray<int32>& Keys, const TArray<int32>& Values);
	static void MessageLog(const class FString& InStr);
	static void MyJson2Struct(const class FString& InsJsonData, class UObject* InObject, TArray<class FString>* OutArrProblem);
	static void MyLog_CheckTip(class UObject* WorldContextObject, bool InbValid, const class FString& PrefixSection, const class FString& InLog);
	static void MyLog_Display(const class FString& PrefixSection, const class FString& InLog);
	static void MyLog_Error(class UObject* WorldContextObject, const class FString& PrefixSection, const class FString& InLog, bool PrintToScreen);
	static void MyLog_Verbose(const class FString& PrefixSection, const class FString& InLog);
	static void MyLog_Warning(class UObject* WorldContextObject, const class FString& PrefixSection, const class FString& InLog, bool PrintToScreen);
	static bool MyParseValue_CommandLine(const class FString& InCommand, const class FString& Param, class FString* OutRes);
	static void MyPrintString(class UObject* WorldContextObject, const class FString& InString, bool bPrintToScreen, bool bPrintToLog, const struct FLinearColor& TextColor, float Duration);
	static void MyPrintStringIfTrue(class UObject* WorldContextObject, const class FString& InMessage, bool InbBool, const struct FLinearColor& InColor, float InfDuration);
	static class FString MyStruct2Json(class UObject* InObject, bool InbReturnDebugString);
	static void OpenHDR(class UObject* WorldContextObject, bool InbNewState);
	static struct FVector RandomOffsetVector(const struct FVector& InLoc, float InfOffset);
	static struct FVector2D RandomOffsetVector2D(const struct FVector2D& InLoc, float InfOffset);
	static TArray<EMyExcludeModulesType> RecursiveSetExcludeStateByParentType(EMyExcludeModulesType InType, bool InbOpenState, class UObject* WorldContextObject);
	static void RestartOrCreateTimerByEvent(const class UObject* WorldContextObject, struct FTimerHandle& InTimerHandle, TDelegate<void()> Delegate, float Time, bool bLooping, float InitialStartDelay, float InitialStartDelayVariance);
	static void SaveAllExcludeModulesHistory(const TMap<EMyExcludeModulesType, bool>& InMapHistory, class UObject* WorldContextObject);
	static void SetEnvironmentVar(const class FString& InKey, const class FString& InVal);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyFunctionLibrary_UtilityTools")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyFunctionLibrary_UtilityTools")
	}
	static class UMyFunctionLibrary_UtilityTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyFunctionLibrary_UtilityTools>();
	}
};
DUMPER7_ASSERTS_UMyFunctionLibrary_UtilityTools;

// Class MyUtilityTools.MyGameEvent
// 0x0008 (0x0030 - 0x0028)
class UMyGameEvent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent")
	}
	static class UMyGameEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent;

// Class MyUtilityTools.MyGameEvent_PostLoginSucc
// 0x0018 (0x0048 - 0x0030)
class UMyGameEvent_PostLoginSucc final : public UMyGameEvent
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_PostLoginSucc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_PostLoginSucc")
	}
	static class UMyGameEvent_PostLoginSucc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_PostLoginSucc>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_PostLoginSucc;

// Class MyUtilityTools.MyGameEvent_OnWindowFocusChanged
// 0x0008 (0x0038 - 0x0030)
class UMyGameEvent_OnWindowFocusChanged final : public UMyGameEvent
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnWindowFocusChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnWindowFocusChanged")
	}
	static class UMyGameEvent_OnWindowFocusChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnWindowFocusChanged>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnWindowFocusChanged;

// Class MyUtilityTools.MyGameEvent_OnUILayoutCreatedOver
// 0x0000 (0x0030 - 0x0030)
class UMyGameEvent_OnUILayoutCreatedOver final : public UMyGameEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnUILayoutCreatedOver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnUILayoutCreatedOver")
	}
	static class UMyGameEvent_OnUILayoutCreatedOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnUILayoutCreatedOver>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnUILayoutCreatedOver;

// Class MyUtilityTools.MyGameEvent_OnUIInitialOver
// 0x0000 (0x0030 - 0x0030)
class UMyGameEvent_OnUIInitialOver final : public UMyGameEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnUIInitialOver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnUIInitialOver")
	}
	static class UMyGameEvent_OnUIInitialOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnUIInitialOver>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnUIInitialOver;

// Class MyUtilityTools.MyGameEvent_OnMainUICreatedOver_CanRegisterEvent
// 0x0000 (0x0030 - 0x0030)
class UMyGameEvent_OnMainUICreatedOver_CanRegisterEvent final : public UMyGameEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnMainUICreatedOver_CanRegisterEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnMainUICreatedOver_CanRegisterEvent")
	}
	static class UMyGameEvent_OnMainUICreatedOver_CanRegisterEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnMainUICreatedOver_CanRegisterEvent>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnMainUICreatedOver_CanRegisterEvent;

// Class MyUtilityTools.MyGameEvent_OnSwitchPIEAndSIE
// 0x0008 (0x0038 - 0x0030)
class UMyGameEvent_OnSwitchPIEAndSIE final : public UMyGameEvent
{
public:
	bool                                          bIsSimulatingInEditor;                             // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnSwitchPIEAndSIE")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnSwitchPIEAndSIE")
	}
	static class UMyGameEvent_OnSwitchPIEAndSIE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnSwitchPIEAndSIE>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnSwitchPIEAndSIE;

// Class MyUtilityTools.MyGameEvent_OnHideAllUIUnlessBasicOperation
// 0x0008 (0x0038 - 0x0030)
class UMyGameEvent_OnHideAllUIUnlessBasicOperation final : public UMyGameEvent
{
public:
	bool                                          bHideAllUI;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnHideAllUIUnlessBasicOperation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnHideAllUIUnlessBasicOperation")
	}
	static class UMyGameEvent_OnHideAllUIUnlessBasicOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnHideAllUIUnlessBasicOperation>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnHideAllUIUnlessBasicOperation;

// Class MyUtilityTools.MyGameEvent_OnBindingPropertyChanged
// 0x0018 (0x0048 - 0x0030)
class UMyGameEvent_OnBindingPropertyChanged final : public UMyGameEvent
{
public:
	class UObject*                                Instance;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnBindingPropertyChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnBindingPropertyChanged")
	}
	static class UMyGameEvent_OnBindingPropertyChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnBindingPropertyChanged>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnBindingPropertyChanged;

// Class MyUtilityTools.MyGameEvent_OnSlateWidgetFocusChanged
// 0x0010 (0x0040 - 0x0030)
class UMyGameEvent_OnSlateWidgetFocusChanged final : public UMyGameEvent
{
public:
	class UWidget*                                OldWidget;                                         // 0x0030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                NewWidget;                                         // 0x0038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnSlateWidgetFocusChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnSlateWidgetFocusChanged")
	}
	static class UMyGameEvent_OnSlateWidgetFocusChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnSlateWidgetFocusChanged>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnSlateWidgetFocusChanged;

// Class MyUtilityTools.MyGameEvent_OnMountPakOver
// 0x0000 (0x0030 - 0x0030)
class UMyGameEvent_OnMountPakOver final : public UMyGameEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnMountPakOver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnMountPakOver")
	}
	static class UMyGameEvent_OnMountPakOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnMountPakOver>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnMountPakOver;

// Class MyUtilityTools.MyGameEvent_OnHudDestroyed
// 0x0000 (0x0030 - 0x0030)
class UMyGameEvent_OnHudDestroyed final : public UMyGameEvent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnHudDestroyed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnHudDestroyed")
	}
	static class UMyGameEvent_OnHudDestroyed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnHudDestroyed>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnHudDestroyed;

// Class MyUtilityTools.MyGameEvent_OnUIDrag_DropEvent
// 0x0080 (0x00B0 - 0x0030)
class UMyGameEvent_OnUIDrag_DropEvent final : public UMyGameEvent
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0030(0x0078)(NativeAccessSpecifierPublic)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEvent_OnUIDrag_DropEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEvent_OnUIDrag_DropEvent")
	}
	static class UMyGameEvent_OnUIDrag_DropEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEvent_OnUIDrag_DropEvent>();
	}
};
DUMPER7_ASSERTS_UMyGameEvent_OnUIDrag_DropEvent;

// Class MyUtilityTools.MyGameEventManager
// 0x0420 (0x0450 - 0x0030)
class UMyGameEventManager final : public UGameInstanceSubsystem
{
public:
	TMap<TSubclassOf<class UMyGameEvent>, struct FMyEventCached> mapListener;                        // 0x0030(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UMyGameEvent>, struct FMyEventParamsRecycleDataCached> mapGameEventParamsRecycleCached; // 0x0080(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class UMyGameEvent*>                   arrInitialCachedGameEventParams;                   // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameplayTag& InTag, class UMyGameEvent* InGameEventParams)> OnBroadcastByTag; // 0x00E8(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x50];                                      // 0x00F8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FMyEventCached_ClassParams> mapInitialCached_Tag;               // 0x0148(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0xF8];                                     // 0x0198(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMyGameEvent*>                   arrPendingBroadcast_Class;                         // 0x0290(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FMyEventCached_ClassParams> mapPendingBroadcast_Tag;            // 0x02A0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x150];                                    // 0x02F0(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMyGameEvent*>                   arrPendingBroadcastInNextFrame;                    // 0x0440(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UMyGameEventManager* GetMyEventManagerByFunc(class UObject* WorldContextObject);

	void AddListenerByFunctionName(TSubclassOf<class UMyGameEvent> InClass, class UObject* ContextObject, class FName InFunctionName);
	void AssignListener(TSubclassOf<class UMyGameEvent> InClass, TDelegate<void(class UMyGameEvent* Param)> Delegate);
	void AssignListenerByTag(const struct FGameplayTag& InTag, TDelegate<void(class UMyGameEvent* Param)> Delegate);
	class UMyGameEvent* BPCall_GetRef_GameEventParam(TSubclassOf<class UMyGameEvent> InClass);
	void Broadcast(class UMyGameEvent* InGameEventParams);
	void BroadcastByDefaultClass(TSubclassOf<class UMyGameEvent> InParamClass);
	void BroadcastByTag(const struct FGameplayTag& InTag, class UMyGameEvent* InGameEventParams);
	void BroadcastInNextFrame(class UMyGameEvent* InGameEventParams);
	void CallBP_Clear();
	void ClearAllListener();
	bool IsHaveBound(class UObject* InObject);
	void RemoveListener(TSubclassOf<class UMyGameEvent> InClass, class FName InFunctionName);
	void SetOpenAndBeginBroadcast(const bool& InOpenAndBeginBroadcast);
	void UnbindListener(TSubclassOf<class UMyGameEvent> InClass, TDelegate<void(class UMyGameEvent* Param)> InDelegate);
	void UnbindListenerByTag(const struct FGameplayTag& InTag, TDelegate<void(class UMyGameEvent* Param)> InDelegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyGameEventManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyGameEventManager")
	}
	static class UMyGameEventManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyGameEventManager>();
	}
};
DUMPER7_ASSERTS_UMyGameEventManager;

// Class MyUtilityTools.MyNormalSaveGame_ExcludeModule
// 0x0058 (0x0080 - 0x0028)
class UMyNormalSaveGame_ExcludeModule final : public USaveGame
{
public:
	TMap<EMyExcludeModulesType, bool>             mapExcludeModuleHistory;                           // 0x0028(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bTheTestMode;                                      // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenTestModeWhenTestPageDisplay;                  // 0x0079(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyNormalSaveGame_ExcludeModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyNormalSaveGame_ExcludeModule")
	}
	static class UMyNormalSaveGame_ExcludeModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyNormalSaveGame_ExcludeModule>();
	}
};
DUMPER7_ASSERTS_UMyNormalSaveGame_ExcludeModule;

// Class MyUtilityTools.MyPlatformSpecificRenderingSettings
// 0x0038 (0x0078 - 0x0040)
class UMyPlatformSpecificRenderingSettings final : public UPlatformSettings
{
public:
	class FString                                 DefaultDeviceProfileSuffix;                        // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMyQualityDeviceProfileVariant> UserFacingDeviceProfileOptions;                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bSupportsGranularVideoQualitySettings;             // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsAutomaticVideoQualityBenchmark;           // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMyFramePacingMode                            FramePacingMode;                                   // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 MobileFrameRateLimits;                             // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyPlatformSpecificRenderingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyPlatformSpecificRenderingSettings")
	}
	static class UMyPlatformSpecificRenderingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyPlatformSpecificRenderingSettings>();
	}
};
DUMPER7_ASSERTS_UMyPlatformSpecificRenderingSettings;

// Class MyUtilityTools.MyPerformanceSettings
// 0x0030 (0x0068 - 0x0038)
class UMyPerformanceSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	struct FPerPlatformSettings                   PerPlatformSettings;                               // 0x0038(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<int32>                                 DesktopFrameRateLimits;                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FMyPerformanceStatGroup>        UserFacingPerformanceStats;                        // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyPerformanceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyPerformanceSettings")
	}
	static class UMyPerformanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyPerformanceSettings>();
	}
};
DUMPER7_ASSERTS_UMyPerformanceSettings;

// Class MyUtilityTools.MySettingsLocal
// 0x0348 (0x0490 - 0x0148)
class UMySettingsLocal final : public UGameUserSettings
{
public:
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMyDisplayablePerformanceStat, EMyStatDisplayMode> DisplayStatList;                         // 0x0150(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x18];                                     // 0x01A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplayGamma;                                      // 0x01B8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FrameRateLimit_OnBattery;                          // 0x01BC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FrameRateLimit_InMenu;                             // 0x01C0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FrameRateLimit_WhenBackgrounded;                   // 0x01C4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CustomUIScale;                                     // 0x01C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MobileFrameRateLimit;                              // 0x01CC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x78];                                     // 0x01D0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DesiredUserChosenDeviceProfileSuffix;              // 0x0248(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentAppliedDeviceProfileOverrideSuffix;         // 0x0258(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 UserChosenDeviceProfileSuffix;                     // 0x0268(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDesiredHeadphoneMode;                             // 0x0290(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHeadphoneMode;                                 // 0x0291(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseHDRAudioMode;                                  // 0x0292(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_293[0xA5];                                     // 0x0293(0x00A5)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AudioOutputDeviceId;                               // 0x0338(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x48];                                     // 0x0348(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bResetSafeZoneScale;                               // 0x0390(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverallVolume;                                     // 0x0394(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MusicVolume;                                       // 0x0398(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SoundFXVolume;                                     // 0x039C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DialogueVolume;                                    // 0x03A0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VoiceChatVolume;                                   // 0x03A4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OverallVolume_OpenState;                           // 0x03A8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MusicVolume_OpenState;                             // 0x03A9(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SoundFXVolume_OpenState;                           // 0x03AA(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DialogueVolume_OpenState;                          // 0x03AB(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          VoiceChatVolume_OpenState;                         // 0x03AC(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USoundControlBus*>    ControlBusMap;                                     // 0x03B0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class USoundControlBusMix*                    ControlBusMix;                                     // 0x0400(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSoundControlBusMixLoaded;                         // 0x0408(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SafeZoneScale;                                     // 0x040C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ControllerPlatform;                                // 0x0410(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ControllerPreset;                                  // 0x0418(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   InputConfigName;                                   // 0x0420(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLoadedMappableConfigPair>      RegisteredInputConfigs;                            // 0x0428(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FKey>                CustomKeyboardConfig;                              // 0x0438(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPlayerMappableInputConfig* GetInputConfigByName(class FName ConfigName);
	void RunAutoBenchmark(bool bSaveImmediately);
	void SetAudioOutputDeviceId(const class FString& InAudioOutputDeviceId);
	void SetControllerPlatform(const class FName InControllerPlatform);
	void SetDesiredDeviceProfileQualitySuffix(const class FString& InDesiredSuffix);
	void SetDialogueVolume(float InVolume);
	void SetDialogueVolume_OpenState(bool InbOpenState);
	void SetDisplayGamma(float InGamma);
	void SetFrameRateLimit_Always(float NewLimitFPS);
	void SetFrameRateLimit_InMenu(float NewLimitFPS);
	void SetFrameRateLimit_OnBattery(float NewLimitFPS);
	void SetFrameRateLimit_WhenBackgrounded(float NewLimitFPS);
	void SetHDRAudioModeEnabled(bool bEnabled);
	void SetHeadphoneModeEnabled(bool bEnabled);
	void SetMusicVolume(float InVolume);
	void SetMusicVolume_OpenState(bool InbOpenState);
