#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NonHumanoid_LaserDogABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "NonHumanoid_LaserDogABP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NonHumanoid_LaserDogABP.NonHumanoid_LaserDogABP_C
// 0x01B0 (0x0620 - 0x0470)
class UNonHumanoid_LaserDogABP_C final : public UBTPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NonHumanoid_LaserDogABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0478(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0480(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0488(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0490(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x04F8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0540(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0588(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05D0(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_NonHumanoid_LaserDogABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NonHumanoid_LaserDogABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NonHumanoid_LaserDogABP_C")
	}
	static class UNonHumanoid_LaserDogABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNonHumanoid_LaserDogABP_C>();
	}
};
DUMPER7_ASSERTS_UNonHumanoid_LaserDogABP_C;

}

