#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NormalZombie01_to_base_Variation

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "NormalZombie01_to_base_Variation_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NormalZombie01_to_base_Variation.NormalZombie01_to_base_Variation_C
// 0x0240 (0x06E0 - 0x04A0)
class UNormalZombie01_to_base_Variation_C final : public UBTAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NormalZombie01_to_base_Variation::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x04A8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04C0(0x0008)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0510(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0558(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x05A0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05E0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0628(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0670(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06B8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_NormalZombie01_to_base_Variation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NormalZombie01_to_base_Variation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NormalZombie01_to_base_Variation_C")
	}
	static class UNormalZombie01_to_base_Variation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalZombie01_to_base_Variation_C>();
	}
};
DUMPER7_ASSERTS_UNormalZombie01_to_base_Variation_C;

}

