#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoxiousSpiderKingABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "NoxiousSpiderKingABP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NoxiousSpiderKingABP.NoxiousSpiderKingABP_C
// 0x03B0 (0x08A0 - 0x04F0)
class UNoxiousSpiderKingABP_C final : public UBTAIAnimIns_NoxiousSpiderKing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NoxiousSpiderKingABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x04F8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0508(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0510(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0538(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0580(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0610(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0658(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x06A0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x06E8(0x0010)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0740(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0788(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0850(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_NoxiousSpiderKingABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NoxiousSpiderKingABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoxiousSpiderKingABP_C")
	}
	static class UNoxiousSpiderKingABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoxiousSpiderKingABP_C>();
	}
};
DUMPER7_ASSERTS_UNoxiousSpiderKingABP_C;

}

