#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleTest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ParticleTest_structs.hpp"


namespace SDK::Params
{

// Function ParticleTest.ParticleTestFunctionLibrary.DeactivateTestNiagaraComponent
// 0x0010 (0x0010 - 0x0000)
struct ParticleTestFunctionLibrary_DeactivateTestNiagaraComponent final
{
public:
	class UNiagaraComponent*                      InNiagaraComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InImmediate;                                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ParticleTestFunctionLibrary_DeactivateTestNiagaraComponent;

// Function ParticleTest.ParticleTestFunctionLibrary.SpawnTestNiagaraAtLocation
// 0x0048 (0x0048 - 0x0000)
struct ParticleTestFunctionLibrary_SpawnTestNiagaraAtLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0040(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestFunctionLibrary_SpawnTestNiagaraAtLocation;

// Function ParticleTest.ParticleTestFunctionLibrary.SpawnTestNiagaraAttached
// 0x0050 (0x0050 - 0x0000)
struct ParticleTestFunctionLibrary_SpawnTestNiagaraAttached final
{
public:
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachPointName;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      ReturnValue;                                       // 0x0048(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestFunctionLibrary_SpawnTestNiagaraAttached;

// Function ParticleTest.ParticleTestGameMode.ClearAllTestParticle
// 0x0001 (0x0001 - 0x0000)
struct ParticleTestGameMode_ClearAllTestParticle final
{
public:
	bool                                          InImmediate;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_ClearAllTestParticle;

// Function ParticleTest.ParticleTestGameMode.GetAllConfigData
// 0x0050 (0x0050 - 0x0000)
struct ParticleTestGameMode_GetAllConfigData final
{
public:
	TMap<class FName, struct FParticleTestConfig> OutData;                                           // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_GetAllConfigData;

// Function ParticleTest.ParticleTestGameMode.GetConfigData
// 0x0068 (0x0068 - 0x0000)
struct ParticleTestGameMode_GetConfigData final
{
public:
	class FName                                   InRowName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParticleTestConfig                    OutData;                                           // 0x0008(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_GetConfigData;

// Function ParticleTest.ParticleTestGameMode.IsMobile
// 0x0001 (0x0001 - 0x0000)
struct ParticleTestGameMode_IsMobile final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_IsMobile;

// Function ParticleTest.ParticleTestGameMode.OnNiagaraFinished
// 0x0008 (0x0008 - 0x0000)
struct ParticleTestGameMode_OnNiagaraFinished final
{
public:
	class UNiagaraComponent*                      InNSC;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_OnNiagaraFinished;

// Function ParticleTest.ParticleTestGameMode.SetEffectsQuality
// 0x0004 (0x0004 - 0x0000)
struct ParticleTestGameMode_SetEffectsQuality final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_SetEffectsQuality;

// Function ParticleTest.ParticleTestGameMode.SpawnTestParticle
// 0x0038 (0x0038 - 0x0000)
struct ParticleTestGameMode_SpawnTestParticle final
{
public:
	struct FParticleTestExecParams                InParams;                                          // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_SpawnTestParticle;

// Function ParticleTest.ParticleTestGameMode.SpawnTestParticle_MultipleExecutions
// 0x0010 (0x0010 - 0x0000)
struct ParticleTestGameMode_SpawnTestParticle_MultipleExecutions final
{
public:
	TArray<struct FParticleTestExecParams>        InParamsList;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ParticleTestGameMode_SpawnTestParticle_MultipleExecutions;

}

