#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleTest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ParticleTest_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ParticleTest.ParticleTestActor
// 0x00D0 (0x0368 - 0x0298)
class AParticleTestActor final : public AActor
{
public:
	uint8                                         Pad_298[0x60];                                     // 0x0298(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementDistanceMax;                               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentDistance;                                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MovingSpeed;                                       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartPoint;                                        // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                EndPoint;                                          // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                DirVec;                                            // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MovingStartTime;                                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MovingEndTime;                                     // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bRecycled : 1;                                     // 0x0358(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RecycledTime;                                      // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EParticleTestActorType                        ParticleTestActorType;                             // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleTestActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleTestActor")
	}
	static class AParticleTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleTestActor>();
	}
};
DUMPER7_ASSERTS_AParticleTestActor;

// Class ParticleTest.ParticleTestFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UParticleTestFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeactivateTestNiagaraComponent(class UNiagaraComponent* InNiagaraComponent, const bool InImmediate);
	static class UNiagaraComponent* SpawnTestNiagaraAtLocation(const class UObject* WorldContextObject, class UNiagaraSystem* SystemTemplate, const struct FVector& Location, const struct FRotator& Rotation);
	static class UNiagaraComponent* SpawnTestNiagaraAttached(class UNiagaraSystem* SystemTemplate, class USceneComponent* AttachToComponent, const class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleTestFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleTestFunctionLibrary")
	}
	static class UParticleTestFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleTestFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UParticleTestFunctionLibrary;

// Class ParticleTest.ParticleTestGameMode
// 0x0040 (0x03B8 - 0x0378)
class AParticleTestGameMode final : public AGameMode
{
public:
	TArray<class UNiagaraComponent*>              NSCPool_Alive;                                     // 0x0378(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AParticleTestActor*>             ParticleTestActorPool_Alive;                       // 0x0388(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AParticleTestActor*>             ParticleTestActorPool_Recycled;                    // 0x0398(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UDataTable*                             ParticleTestConfigTable;                           // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AParticleTestActor>         ParticleTestActorClass;                            // 0x03B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearAllTestParticle(const bool InImmediate);
	void GetAllConfigData(TMap<class FName, struct FParticleTestConfig>* OutData);
	void GetConfigData(class FName InRowName, struct FParticleTestConfig* OutData);
	bool IsMobile();
	void OnNiagaraFinished(class UNiagaraComponent* InNSC);
	void SetEffectsQuality(int32 InLevel);
	void SpawnTestParticle(const struct FParticleTestExecParams& InParams);
	void SpawnTestParticle_MultipleExecutions(const TArray<struct FParticleTestExecParams>& InParamsList);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleTestGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleTestGameMode")
	}
	static class AParticleTestGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleTestGameMode>();
	}
};
DUMPER7_ASSERTS_AParticleTestGameMode;

// Class ParticleTest.ParticleTestPlayerController
// 0x0000 (0x0860 - 0x0860)
class AParticleTestPlayerController final : public APlayerController
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleTestPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleTestPlayerController")
	}
	static class AParticleTestPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleTestPlayerController>();
	}
};
DUMPER7_ASSERTS_AParticleTestPlayerController;

}

