#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Barrett01_InGame_ABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC_Barrett01_InGame_ABP.PC_Barrett01_InGame_ABP_C
// 0x04D0 (0x0840 - 0x0370)
class UPC_Barrett01_InGame_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x03A8(0x01A0)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x0548(0x01A0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06E8(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_PC_Barrett01_InGame_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PC_Barrett01_InGame_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PC_Barrett01_InGame_ABP_C")
	}
	static class UPC_Barrett01_InGame_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC_Barrett01_InGame_ABP_C>();
	}
};
DUMPER7_ASSERTS_UPC_Barrett01_InGame_ABP_C;

}

