#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_SakuraArasaka_01_InGame_ABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC_SakuraArasaka_01_InGame_ABP.PC_SakuraArasaka_01_InGame_ABP_C
// 0x13A0 (0x1710 - 0x0370)
class UPC_SakuraArasaka_01_InGame_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x03B0(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0C90(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1570(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x16C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x16E8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_SakuraArasaka_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_3857DB994F390C348D9815B27C388E9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_SakuraArasaka_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_9DC0423741A17A16F6DD79B8AA34DE69();
	void ExecuteUbergraph_PC_SakuraArasaka_01_InGame_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PC_SakuraArasaka_01_InGame_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PC_SakuraArasaka_01_InGame_ABP_C")
	}
	static class UPC_SakuraArasaka_01_InGame_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC_SakuraArasaka_01_InGame_ABP_C>();
	}
};
DUMPER7_ASSERTS_UPC_SakuraArasaka_01_InGame_ABP_C;

}

