#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Victor_01_InGame_ABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC_Victor_01_InGame_ABP.PC_Victor_01_InGame_ABP_C
// 0x4000 (0x4370 - 0x0370)
class UPC_Victor_01_InGame_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x03B0(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0C90(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1570(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1E50(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2730(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3010(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x38F0(0x08E0)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x41D0(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x4328(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4348(0x0020)()
	class USkeletalMeshComponent*                 Source_Mesh_Component;                             // 0x4368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_0033B45944F4C91A5803EABDEE26D191();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_30C140CF47FFBF38938A9D8D8509DD26();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_3D567F0C47C733B6BA187FA7F544FF3C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_4A302BEC4CB281F16ED51786A941F50E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_B88F2F064E472A99D4AD82840D190FC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_F9292A804CCB1CAADF1604B98C907DD9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PC_Victor_01_InGame_ABP_AnimGraphNode_KawaiiPhysics_FD033973404B051830A0838C44262FD9();
	void ExecuteUbergraph_PC_Victor_01_InGame_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PC_Victor_01_InGame_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PC_Victor_01_InGame_ABP_C")
	}
	static class UPC_Victor_01_InGame_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC_Victor_01_InGame_ABP_C>();
	}
};
DUMPER7_ASSERTS_UPC_Victor_01_InGame_ABP_C;

}

