#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropSkill_AutoAdsorbed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BroTatoCommon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.BP_AutoAdsorbedToTarget
// 0x0008 (0x0008 - 0x0000)
struct PropSkill_AutoAdsorbed_C_BP_AutoAdsorbedToTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_BP_AutoAdsorbedToTarget;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.ExecuteUbergraph_PropSkill_AutoAdsorbed
// 0x0158 (0x0158 - 0x0000)
struct PropSkill_AutoAdsorbed_C_ExecuteUbergraph_PropSkill_AutoAdsorbed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InTarget;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0060(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_ExecuteUbergraph_PropSkill_AutoAdsorbed;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.HideEffect_Icon
// 0x0001 (0x0001 - 0x0000)
struct PropSkill_AutoAdsorbed_C_HideEffect_Icon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_HideEffect_Icon;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.HideEffect_LightBeam
// 0x0001 (0x0001 - 0x0000)
struct PropSkill_AutoAdsorbed_C_HideEffect_LightBeam final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_HideEffect_LightBeam;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.ShowEffect_Icon
// 0x0008 (0x0008 - 0x0000)
struct PropSkill_AutoAdsorbed_C_ShowEffect_Icon final
{
public:
	double                                        InOffsetZ;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_ShowEffect_Icon;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.ShowEffect_LightBeam
// 0x0018 (0x0018 - 0x0000)
struct PropSkill_AutoAdsorbed_C_ShowEffect_LightBeam final
{
public:
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_BP_SpawnEffectAttached_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_ShowEffect_LightBeam;

// Function PropSkill_AutoAdsorbed.PropSkill_AutoAdsorbed_C.UpdateEffectIcon
// 0x00A0 (0x00A0 - 0x0000)
struct PropSkill_AutoAdsorbed_C_UpdateEffectIcon final
{
public:
	class UNiagaraComponent*                      InNSC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTRB                               CallFunc_GetItemCfg_ReturnValue;                   // 0x0010(0x0068)()
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PropSkill_AutoAdsorbed_C_UpdateEffectIcon;

}

