#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SandBomber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BroTatoCommon_structs.hpp"


namespace SDK::Params
{

// Function SandBomber.SandBomber_C.BP_PlayExplosionEffects
// 0x0001 (0x0001 - 0x0000)
struct SandBomber_C_BP_PlayExplosionEffects final
{
public:
	EDmgType                                      InDmgType;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SandBomber_C_BP_PlayExplosionEffects;

// Function SandBomber.SandBomber_C.ExecuteUbergraph_SandBomber
// 0x0030 (0x0030 - 0x0000)
struct SandBomber_C_ExecuteUbergraph_SandBomber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDmgType                                      K2Node_Event_InDmgType;                            // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SandBomber_C_ExecuteUbergraph_SandBomber;

}

