#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Twins_Ice_ABP

#include "Basic.hpp"

#include "BroTato_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Twins_Ice_ABP_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Twins_Ice_ABP.Twins_Ice_ABP_C
// 0x0580 (0x0A80 - 0x0500)
class UTwins_Ice_ABP_C final : public UBTAIAnimIns_Twins
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Twins_Ice_ABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                // 0x0508(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0518(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0520(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0528(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0548(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0590(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05D8(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0648(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0690(0x00D0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0760(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0770(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x07B8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x08A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x08D0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x08F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0940(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0968(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09B0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09F8(0x0080)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Twins_Ice_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Twins_Ice_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Twins_Ice_ABP_C")
	}
	static class UTwins_Ice_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwins_Ice_ABP_C>();
	}
};
DUMPER7_ASSERTS_UTwins_Ice_ABP_C;

}

